[
  {
    "Title": "Partner plank band row",
    "Desc": "The partner plank band row is an abdominal exercise where two partners perform single-arm planks while pulling on the opposite ends of an exercise band. This technique can be done for time or reps in any ab-focused workout.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Bands",
    "Level": "Intermediate",
    "Rating": 0,
    "RatingDesc": ""
  },
  {
    "Title": "Barbell roll-out",
    "Desc": "The barbell roll-out is an abdominal exercise that utilizes a barbell in the place of an ab roller. It is best performed with a barbell that has rotating collars, and is considered more difficult than other ab roller variations. Many lifters may not be able to perform a single rep at first, but once they can perform these for reps, they'll be rewarded with a seriously strong core.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Barbell",
    "Level": "Intermediate",
    "Rating": 8.9,
    "RatingDesc": "Average"
  },
  {
    "Title": "Barbell Ab Rollout - On Knees",
    "Desc": "The barbell roll-out is an abdominal exercise that utilizes a barbell in the place of an ab roller. It is best performed with a barbell that has rotating collars, and is considered more difficult than other ab roller variations. Many lifters may not be able to perform a single rep at first, but once they can perform these for reps, they'll be rewarded with a seriously strong core.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Barbell",
    "Level": "Intermediate",
    "Rating": 8.9,
    "RatingDesc": "Average"
  },
  {
    "Title": "Decline bar press sit-up",
    "Desc": "The decline bar press sit-up is a weighted core exercise targeting the abdominal muscles, particularly the lower abs. It also challenges the shoulders and upper back to move the weight. Weighted sit-up variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the core-focused portion of a workout.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Barbell",
    "Level": "Intermediate",
    "Rating": 8.5,
    "RatingDesc": "Average"
  },
  {
    "Title": "Bench barbell roll-out",
    "Desc": "The bench barbell roll-out is a challenging exercise targeting the abdominals. It is similar to using an ab roller, but using a barbell allows for a wider grip. Placing the knees on a bench rather than the floor makes the move more difficult by increasing the challenge to the upper body.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Barbell",
    "Level": "Beginner",
    "Rating": 8.3,
    "RatingDesc": "Average"
  },
  {
    "Title": "Seated bar twist",
    "Desc": "The seated bar twist is a core exercise meant to strengthen the obliques. It is often performed for high reps with relatively light weight, such as an empty barbell, a lightweight fixed-weight bar, or even a PVC pipe. It can be performed during a workout, at the end of a workout, or outside of the gym to build core strength and resiliency.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Barbell",
    "Level": "Intermediate",
    "Rating": 4.7,
    "RatingDesc": "Average"
  },
  {
    "Title": "Kettlebell Windmill",
    "Desc": "The single-kettlebell windmill is a dynamic kettlebell exercise emphasizing core strength and shoulder and hip mobility and stability. It is often used as a functional warm-up or for multi-directional strength work. It doesn't work as well in a metcon or conditioning setting, and shouldn't be performed under intense fatigue.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Kettlebells",
    "Level": "Intermediate",
    "Rating": 7.7,
    "RatingDesc": "Average"
  },
  {
    "Title": "Kettlebell 3-point leg extension",
    "Desc": "The kettlebell 3-point leg extension is a dynamic core exercise performed around and over a kettlebell or other short, stationary object. It is similar in some ways to a V-up or reverse crunch, but targets both the obliques and the rectus abdominis or \"six-pack\" muscles. It can be performed for reps or for time, usually in dedicated ab training or as part of a kettlebell and bodyweight circuit workout.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Kettlebells",
    "Level": "Intermediate",
    "Rating": 0,
    "RatingDesc": ""
  },
  {
    "Title": "Dumbbell V-Sit Cross Jab",
    "Desc": "The dumbbell V-sit cross jab is a hybrid movement that trains the abdominal and shoulder muscles simultaneously. It can address multiple muscle groups in a time-efficient muscle-building or circuit-style workout, while also providing a cardiovascular challenge.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Dumbbell",
    "Level": "Intermediate",
    "Rating": 9.3,
    "RatingDesc": "Average"
  },
  {
    "Title": "Dumbbell spell caster",
    "Desc": "The dumbbell spell caster is an exercise that primarily targets the abdominal muscles such as the obliques. However, it also works shoulders, back, hips, and legs, and demands all of those muscles work together in a coordinated motion. It is usually performed with relatively light weights for moderate to high reps, at least 8-12 reps per side. Make sure to only use a weight you can control.",
    "Type": "Strength",
    "BodyPart": "Abdominals",
    "Equipment": "Dumbbell",
    "Level": "Beginner",
    "Rating": 9.3,
    "RatingDesc": "Average"
  }
]