{
  "Decline bar press sit-up": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Kettlebell Windmill": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Kettlebell 3-point leg extension": "Kettlebell Sport lifting (Russian: гиревой спорт, girevoy sport, GS) a.k.a. Girya is a repetitive weight lifting sport performed with kettlebells in a given period of time.Competitive kettlebell lifting has a long history in Russia and Eastern Europe, but developed as an organised, standard sport under the name kettlebell lifting during the 1960s.",
  "Dumbbell side bend": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Suspended ab fall-out": "The AB 250-3 (Abwurfbehälter) was an anti-personnel cluster bomb used by the Luftwaffe during World War II.   \n\n",
  "Decline reverse crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Sledgehammer swing": "A sledgehammer is a tool with a large, flat, often metal head, attached to a long handle. The long handle combined with a heavy head allows the sledgehammer to gather momentum during a swing and apply a large force compared to hammers designed to drive nails. Along with the mallet, it shares the ability to distribute force over a wide area.  This is in contrast to other types of hammers, which concentrate force in a relatively small area.\n\n",
  "Suitcase crunch": "Away is an American luggage and travel accessories brand founded by Jen Rubio and Steph Korey in 2015 and based in New York City.  Having raised $31 million in financing, Away is one of the highest funded female-backed startups.The company primarily sells products online, but also has brick and mortar locations. Away is a direct-to-consumer retailer, so the company bypasses third-party wholesalers or distributors. Its products are available for purchase in the US, Canada and the UK.",
  "Standing cable low-to-high twist": "Coaxial cable, or coax (pronounced ), is a type of electrical cable consisting of an inner conductor surrounded by a concentric conducting shield, with the two separated by a dielectric (insulating material); many coaxial cables also have a protective outer sheath or jacket. The term coaxial refers to the inner conductor and the outer shield sharing a geometric axis.\nCoaxial cable is a type of transmission line, used to carry high-frequency electrical signals with low losses.  It is used in such applications as telephone trunk lines, broadband internet networking cables, high-speed computer data busses, cable television signals, and connecting radio transmitters and receivers to their antennas. It differs from other shielded cables because the dimensions of the cable and connectors are controlled to give a precise, constant conductor spacing, which is needed for it to function efficiently as a transmission line.\n\nCoaxial cable was used in the first (1858) and following transatlantic cable installations, but its theory was not described until 1880 by English physicist, engineer, and mathematician Oliver Heaviside, who patented the design in that year (British patent No. 1,407).",
  "Single-arm high-cable side bend": "A bicycle brake reduces the speed of a bicycle or prevents the wheels from moving. The two main types are: rim brakes and disc brakes. Drum brakes are less common on bicycles.\nMost bicycle brake systems consist of three main components: a mechanism for the rider to apply the brakes, such as brake levers or pedals; a mechanism for transmitting that signal, such as Bowden cables, hydraulic hoses, rods, or the bicycle chain; and the brake mechanism itself, a caliper or drum, to press two or more surfaces together in order to convert, via friction, kinetic energy of the bike and rider into thermal energy to be dissipated.",
  "Kneeling cable oblique crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Kneeling cable crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Standing cable crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Standing Cable Wood Chop": "Woodsman (also, woodsmen, pl.) refers to the title of competitors participating in competitive timber sports. Woodsmen participate in various events that replicate real skills used by lumberjacks while cutting down trees and preparing the wood. Woodsman Competitions are a competitive, co-ed intercollegiate sport in the United States, Canada and elsewhere based on various skills traditionally part of forestry educational and technical training programs.  In these competitions participants use various tools, such as racing axes, throwing axes, cross-cut saws, and chainsaws. In North America, the sport currently is organized in five regional divisions: northeastern, mid-Atlantic, southern, midwestern, and western.\n\n",
  "Cable reverse crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Ab Crunch Machine": "Abdominal exercises are a type of strength exercise that affect the abdominal muscles (colloquially known as the stomach muscles or \"abs\"). Human abdominal consist of four muscles which are the rectus abdomens, internal oblique, external oblique, and transversus abdominis. When performing abdominal exercises it is important to understand the effects, functions, the types of exercises, and think about how to perform this exercise safely.",
  "Cross-Body Crunch": "Abdominal exercises are a type of strength exercise that affect the abdominal muscles (colloquially known as the stomach muscles or \"abs\"). Human abdominal consist of four muscles which are the rectus abdomens, internal oblique, external oblique, and transversus abdominis. When performing abdominal exercises it is important to understand the effects, functions, the types of exercises, and think about how to perform this exercise safely.",
  "Elbow-to-knee crunch": "Lethwei (Burmese: လက်ဝှေ့; IPA: [lɛʔ.ʍḛ]) or Burmese boxing is a full contact combat sport from Myanmar that uses stand-up striking including headbutts. Lethwei is considered to be one of the most brutal martial arts in the world, as the sport is practiced bareknuckle with only tape and gauze while fighters are allowed to strike with their fists, elbows, knees, and feet, and the use of headbutts is also permitted. Disallowed in most combat sports, headbutts are important weapons in a Lethwei fighter's arsenal, giving Lethwei its name of the \"Art of nine limbs\". This, combined with its bareknuckle nature, gave Lethwei a reputation for being one of the bloodiest and most violent martial arts. Although popular throughout modern Myanmar, Lethwei has been primarily and historically associated with the Karen people of the Kayin State; vast majority of competitive Lethwei fighters are ethnolinguistically of Karen descent.\n\n",
  "Decline Crunch": "Crunch Fitness is a U.S.-based brand of over 400 franchised and corporate owned fitness clubs located in the United States, Puerto Rico, Canada, Spain, Portugal, Costa Rica, and Australia. Founded by Doug Levine in 1989, its current Worldwide CEO is Jim Rowley.\n\n",
  "Hanging Oblique Knee Raise": "The leg raise is a strength training exercise which targets the iliopsoas (the anterior hip flexors). Because the abdominal muscles are used isometrically to stabilize the body during the motion, leg raises are also often used to strengthen the rectus abdominis muscle and the internal and external oblique muscles.",
  "Hanging leg raise": "The leg raise is a strength training exercise which targets the iliopsoas (the anterior hip flexors). Because the abdominal muscles are used isometrically to stabilize the body during the motion, leg raises are also often used to strengthen the rectus abdominis muscle and the internal and external oblique muscles.",
  "Ab bicycle": "Abdominal exercises are a type of strength exercise that affect the abdominal muscles (colloquially known as the stomach muscles or \"abs\"). Human abdominal consist of four muscles which are the rectus abdomens, internal oblique, external oblique, and transversus abdominis. When performing abdominal exercises it is important to understand the effects, functions, the types of exercises, and think about how to perform this exercise safely.",
  "3/4 sit-up": "Sit Down, Shut Up  (sometimes also known as Sit Down, Shut Up! in some promos) is  an American adult animated television series developed by Mitchell Hurwitz for the Fox Broadcasting Company. The series focuses on a group of high school teachers in a small town in Florida \"who don't care about teaching\". The series premiered on April 19, 2009, in the Animation Domination block on Fox, but after four episodes aired, Fox removed the show from the block due to low ratings. The remaining nine episodes aired on Saturdays at midnight from later in the year. The show was cancelled on November 21, 2009.Based on the Australian live-action sitcom of the same name, creator Mitchell Hurwitz came up with the idea for an animated version in 2000. He wrote a script for a pilot episode, but \"kept it in a drawer\" until he pitched the show to different networks in 2008 when he needed money. Hurwitz said that \"it was just a wacky show, and nobody wanted it\", but eventually Fox picked it up as a primetime animated series.Sit Down, Shut Up met with mixed reviews from critics. Orlando Sentinel called the series a \"disaster\", and Newsday called it \"raw, vulgar and blithely offensive, with so many triple and quadruple entendres for so many sexual acts\". The Hollywood Reporter criticized the series' use of fourth wall breaks, and said that it was \"painful to watch how hard the show tries to be funny\". IGN gave it a more positive review, saying \"it should continue to be a very entertaining show\", and TV Squad said that it \"definitely grows on you\". It was nominated an Artios Award for its casting in 2009.\n\n",
  "Reverse crunch": "The crunch is an abdominal exercise that works the rectus abdominis muscle. It enables both building \"six-pack\" abs and tightening the belly. Crunches use the exerciser's own body weight to tone muscle and are recommended by some experts, despite negative research results, as a low-cost exercise that can be performed at home. Crunches are less effective than other exercises such as planks and carry risk of back injury.",
  "Crunches": "The crunch is an abdominal exercise that works the rectus abdominis muscle. It enables both building \"six-pack\" abs and tightening the belly. Crunches use the exerciser's own body weight to tone muscle and are recommended by some experts, despite negative research results, as a low-cost exercise that can be performed at home. Crunches are less effective than other exercises such as planks and carry risk of back injury.",
  "Dead bug reach": "Bed bugs are parasitic insects from the genus Cimex, who are micropredators that feed on blood, usually at night. Their bites can result in a number of health impacts including skin rashes, psychological effects, and allergic symptoms. Bed bug bites may lead to skin changes ranging from small areas of redness to prominent blisters. Symptoms may take between minutes to days to appear and itchiness is generally present. Some individuals may feel tired or have a fever. Typically, uncovered areas of the body are affected. Their bites are not known to transmit any infectious disease. Complications may rarely include areas of dead skin or vasculitis.Bed bug bites are caused primarily by two species of insects: Cimex lectularius (the common bed bug) and Cimex hemipterus, found primarily in the tropics. Their size ranges between 1 and 7 mm. They spread by crawling between nearby locations or by being carried within personal items. Infestation is rarely due to a lack of hygiene but is more common in high-density areas. Diagnosis involves both finding the bugs and the occurrence of compatible symptoms. Bed bugs spend much of their time in dark, hidden locations like mattress seams, or cracks in a wall.Treatment is directed towards the symptoms. Eliminating bed bugs from the home is often difficult, partly because bed bugs can survive up to approximately 300 days without feeding. Repeated treatments of a home may be required. These treatments may include heating the room to 50 °C (122 °F) for more than 90 minutes, frequent vacuuming, washing clothing at high temperatures, and the use of various pesticides.Fossils found in Egypt show bed bugs have been known as human parasites for at least 3,500 years. Despite being nearly eradicated in developed countries after World War II, infestations have increased since the 1990s and bed bugs are now relatively common in all regions of the globe. Experts point to several factors that have contributed to the explosion in infestations over the last three decades: increased immigration and international travel; expanded markets for second-hand goods; a greater focus on control of other pests; and both the banning of effective pesticides and increased resistance to pesticides still in use.",
  "V-up": "The Volkswagen Up (stylized as Volkswagen up!) is a city car produced by the Volkswagen Group from 2011 to 2023. It was unveiled at the 2011 International Motor Show Germany (IAA). Production of the Up started with the model year of 2012, in December 2011 at the Volkswagen Plant in Bratislava, Slovakia. It is part of the New Small Family (NSF) series of models, alongside the SEAT Mii and Škoda Citigo which are rebadged versions of the Up, with slightly different front and rear fascias. The SEAT and Škoda versions were manufactured in the same factory, before being withdrawn from sale in 2021 and 2020 respectively. Production of the Up ended in October 2023. A battery electric version, called E-up, was launched in autumn 2013.",
  "Russian twist": "The Russian twist is a simple abdominal exercise for working the core, shoulders, and hips. It is typically performed in repetitive sets and tones the core muscles via a twisting motion focused around the abdomen. The exercise can help build strength in the upper torso, which may help in sports such as tennis, swimming, baseball and football, track & field, hockey, golf, lacrosse, or boxing. There are also many variations of the Russian twist that can be used to intensify a workout routine.\n\n",
  "Feet-elevated oblique crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Bent-knee reverse crunch": "The crunch is an abdominal exercise that works the rectus abdominis muscle. It enables both building \"six-pack\" abs and tightening the belly. Crunches use the exerciser's own body weight to tone muscle and are recommended by some experts, despite negative research results, as a low-cost exercise that can be performed at home. Crunches are less effective than other exercises such as planks and carry risk of back injury.",
  "Sit-up": "The sit-up (or curl-up) is an abdominal endurance training exercise to strengthen, tighten and tone the abdominal muscles. It is similar to a crunch (crunches target the rectus abdominis and also work the external and internal obliques), but sit-ups have a fuller range of motion and condition additional muscles.",
  "Side Bridge": "The Eshima Ohashi Bridge (Japanese: 江島大橋, Hepburn: Eshima Ōhashi) is a rigid-frame bridge in Japan that connects Matsue, Shimane Prefecture, and Sakaiminato, Tottori Prefecture, over Nakaumi lake. It was built from 1997 to 2004, and it is the largest rigid-frame bridge in Japan and the third largest in the world. Images of the bridge have been widely circulated on the internet, owing to its seemingly steep nature when photographed from a distance with a telephoto lens, but in actuality, it has a less pronounced, 6.1% gradient in the side of Shimane and a 5.1% gradient in the side of Tottori.Eshima Ohashi Bridge replaced the previous drawbridge, since traffic was obstructed often by ships for about 7 to 8 minutes, only vehicles under 14 tons were allowed and only 4000 vehicles could cross it per day.\n\n",
  "Lying oblique crunch": "Abdominal exercises are a type of strength exercise that affect the abdominal muscles (colloquially known as the stomach muscles or \"abs\"). Human abdominal consist of four muscles which are the rectus abdomens, internal oblique, external oblique, and transversus abdominis. When performing abdominal exercises it is important to understand the effects, functions, the types of exercises, and think about how to perform this exercise safely.",
  "Leg Pull-In": "The leg is the entire lower limb of the human body, including the foot, thigh or sometimes even the hip or buttock region. The major bones of the leg are the femur (thigh bone), tibia (shin bone), and adjacent fibula. The thigh is between the hip and knee, while the calf (rear) and shin (front) are between the knee and foot.Legs are used for standing, many forms of human movement, recreation such as dancing, and constitute a significant portion of a person's mass. Evolution has led to the human leg's development into a mechanism specifically adapted for efficient bipedal gait. While the capacity to walk upright is not unique to humans, other primates can only achieve this for short periods and at a great expenditure of energy. In humans, female legs generally have greater hip anteversion and tibiofemoral angles, while male legs have longer femur and tibial lengths.",
  "Exercise ball torso rotation": "Abdominal exercises are a type of strength exercise that affect the abdominal muscles (colloquially known as the stomach muscles or \"abs\"). Human abdominal consist of four muscles which are the rectus abdomens, internal oblique, external oblique, and transversus abdominis. When performing abdominal exercises it is important to understand the effects, functions, the types of exercises, and think about how to perform this exercise safely.",
  "Wall mountain climber": "This is a list of climbers and mountaineers who are notable for their activities in mountaineering (including alpine climbing), rock climbing (including aid climbing, free climbing, bouldering, speed climbing and competition climbing) or in ice climbing (including mixed climbing).",
  "Hanging leg raise with throw down": "Professional wrestling throws are the application of professional wrestling techniques that involve lifting the opponent up and throwing or slamming them down. They are sometimes also called \"power\" maneuvers, as they are meant to emphasize a wrestler's strength. Many of these moves are used as finishers by various wrestlers, who refer to them by several different names that reflect their gimmick. Moves are listed under general categories whenever possible.",
  "Exercise ball knee roll-in": "The duckwalk is a form of dance performed by assuming a low partial squatting position and walking forwards, maintaining the low stance. It is similar to stalking and prowling. It is most widely known as a stage element of guitar showmanship popularized by rock 'n' roll guitarist Chuck Berry.\nIt is also a physical exercise commonly used in military training.\nChuck Berry's other guitar playing stunt, his one-legged hop routine with the other leg waving in the air is also known as a duckwalk.",
  "Crab toe-touch": "A claw is a curved, pointed appendage found at the end of a toe or finger in most amniotes (mammals, reptiles, birds). Some invertebrates such as beetles and spiders have somewhat similar fine, hooked structures at the end of the leg or tarsus for gripping a surface as they walk. The pincers of crabs, lobsters and scorpions, more formally known as their chelae, are sometimes called claws.\nA true claw is made of a hard protein called keratin. Claws are used to catch and hold prey in carnivorous mammals such as cats and dogs, but may also be used for such purposes as digging, climbing trees, self-defense and grooming, in those and other species.\nSimilar appendages that are flat and do not come to a sharp point are called nails instead. Claw-like projections that do not form at the end of digits but spring from other parts of the foot are properly named spurs.\n\n",
  "Side kick-through": "In gridiron football, an onside kick is a kickoff deliberately kicked short in an attempt by the kicking team to regain possession of the ball. This is in contrast with a typical kickoff, in which the kicking team kicks the ball far downfield in order to maximize the distance the receiving team has to advance the ball in order to score. The risk to the team attempting an onside kick is that if it is unsuccessful the receiving team gets the ball and usually has a much better field position than with a normal kickoff.\nThe onside kick has a low success rate, though its chances of success increase in a situation where the returning team does not expect it. It is generally only seen late in a game when a team has just scored but is still trailing by 8 points or fewer (the most points that can be scored on a single possession) and needs to regain possession in order to score again before time expires.\n\n",
  "Partner target sit-up": "The history of Target Corporation first began in 1902 by George Dayton. The company was originally named Goodfellow Dry Goods in June 1902 before being renamed the Dayton's Dry Goods Company in 1903 and later the Dayton Company in 1910. The first Target store opened in Roseville, Minnesota in 1962 while the parent company was renamed the Dayton Corporation in 1967. It became the Dayton-Hudson Corporation after merging with the J.L. Hudson Company in 1969 and held ownership of several department store chains including Dayton's, Hudson's, Marshall Field's, and Mervyn's. In 2000, the Dayton-Hudson Corporation was renamed to Target Corporation.",
  "Dumbbell suitcase crunch": "This article is a list of episodes for long-running children's television series The Sooty Show.\n\n",
  "Sit-up with single-arm overhand throw": "This is an alphabetical list of selected unofficial and specialized terms, phrases, and other jargon used in baseball, along with their definitions, including illustrative examples for many entries.",
  "Medicine ball partner twist": "The Challenge: Australia is the Australian adaptation of the American reality competition series The Challenge. The first season featured twenty-two Australian reality television contestants and celebrities competing against one another in various challenges to avoid elimination.The series, hosted by TV presenter and sports commentator Brihony Dawson, premiered on Network 10 on 14 November 2022. Due to low viewership, the series was moved to 10 Shake from episode 7.",
  "Decline oblique crunch": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Exercise Ball Pull-In": "The pull-down exercise is a strength training exercise designed to develop the latissimus dorsi muscle. It performs the functions of downward rotation and depression of the scapulae combined with adduction and extension of the shoulder joint.\nThe cable lat pull-down is done where the handle is moved via a cable pulley, as opposed to doing pull-downs on a leverage machine.\n\n",
  "Exercise ball crunch": "Abdominal exercises are a type of strength exercise that affect the abdominal muscles (colloquially known as the stomach muscles or \"abs\"). Human abdominal consist of four muscles which are the rectus abdomens, internal oblique, external oblique, and transversus abdominis. When performing abdominal exercises it is important to understand the effects, functions, the types of exercises, and think about how to perform this exercise safely.",
  "Feet-elevated crunch": "The High Court of Bombay is the high court of the states of Maharashtra and Goa in India, and the union territory of Dadra and Nagar Haveli and Daman and Diu. It is seated primarily at Mumbai (formerly known as Bombay), and is one of the oldest high courts in India. The High Court has circuit benches at Nagpur and Aurangabad in Maharashtra and Panaji, the capital of Goa.The first Chief Justice, the Attorney General and the Solicitor General of Independent India were from this court. Since India's Independence, 22 judges from this court have been elevated to the Supreme Court and 8 have been appointed to the office of Chief Justice of India.The court has Original Jurisdiction in addition to its Appellate. Judgments issued by this court can be appealed only to the Supreme Court of India. The Bombay High Court has a sanctioned strength of 94 judges (71 permanent, 23 additional). The building is part of The Victorian and Art Deco Ensemble of Mumbai, which was added to the list of World Heritage Sites in 2018.\nAs of 2022, the Court is currently understaffed, with only 57 judges as against the permitted number of 96 judges.",
  "Adductor SMR": "ICD-9-CM Volume 3 is a system of procedural codes used by health insurers to classify medical procedures for billing purposes. It is a subset of the International Statistical Classification of Diseases and Related Health Problems (ICD) 9-CM.\nVolumes 1 and 2 are used for diagnostic codes.",
  "Lateral box jump": "Plyometrics, also known as jump training or plyos, are exercises in which muscles exert maximum force in short intervals of time, with the goal of increasing power (speed-strength). This training focuses on learning to move from a muscle extension to a contraction in a rapid or \"explosive\" manner, such as in specialized repeated jumping. Plyometrics are primarily used by athletes, especially martial artists, sprinters and high jumpers, to improve performance, and are used in the fitness field to a much lesser degree.",
  "Thigh adductor": "The adductor muscles of the hip are a group of muscles in the medial compartment of the thigh mostly used for bringing the thighs together (called adduction).",
  "Lateral hop": "Hopscotch is a popular playground game in which players toss a small object, called a lagger, into numbered triangles or a pattern of rectangles outlined on the ground and then hop or jump through the spaces and retrieve the object. It is a children's game that can be played with several players or alone. Hopscotch is a physical and cognitive workout.",
  "Single-leg lying cross-over stretch": "The Boston crab is a professional wrestling hold that typically starts with one wrestler lying in a supine position on the mat, with the other wrestler standing and facing them. It is a type of spinal lock where the wrestler hooks each of the opponent’s legs in one of their arms and then turns the opponent face-down, stepping over them in the process. The final position has the wrestler in a semi-sitting position and facing away from the opponent, with the opponent’s back and legs bent back toward their head. The original name for the maneuver was the Backbreaker, before that term became known for its current usage. In modern wrestling, the Boston crab is not treated as a lethal submission maneuver, even though it was considered a match-ending hold in the past.\nIn submission grappling, the Boston crab (generally the half Boston crab) can be used to set up a straight ankle lock. On September 30, 2017, Jonno Mears became the first fighter in mixed martial arts history to win a fight with the Boston crab.\n\n",
  "Carioca quick step": "Carioca (Portuguese pronunciation: [kaɾiˈɔkɐ]  or [kɐɾiˈɔkɐ]) is a demonym used to refer to anything related to the City of Rio de Janeiro, in Brazil. The original meaning of the term is controversial, maybe from Tupi language \"kari' oka\", meaning \"white house\" as the whitewashed stone houses of European settlers or even the colonists themselves, by merging \"kara'iwa\" (white man) and \"oka\" (house). Currently, the more accepted origin in academia is the meaning derived from \"kariîó oka\", which comes from the indigenous tupi \"house of carijó\", which was Guaraní, a native tribe of Rio de Janeiro who lived in the vicinity of the Carioca River, between the neighborhoods of Glória and Flamengo.\nLike other Brazilians, Cariocas speak Portuguese. The carioca accent and sociolect (also simply called \"carioca\", see below) are one of the most widely recognized in Brazil, in part because TV Globo, the second-largest television network in the world, is headquartered in Rio de Janeiro. Thus, many Brazilian TV programs, from news and documentary to entertainment (such as the telenovelas), feature carioca-acting and -speaking talent.",
  "Standing hip circle": "Do-si-do is a dance move in squaredancing where two partner, standing next to each other and both facing opposite directions, clasp arms together and go in a circle.",
  "Wide-grip barbell curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "EZ-bar spider curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Barbell Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Preacher Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Close-grip barbell curl": "A barbell is a piece of exercise equipment used in weight training, bodybuilding, weightlifting, powerlifting and strongman, consisting of a long bar, usually with weights attached at each end.\nBarbells range in length from 1.2 metres (4 ft) to above 2.4 metres (8 ft), although bars longer than 2.2 metres (7.2 ft) are used primarily by powerlifters and are not commonplace. The central portion of the bar varies in diameter from 25 millimetres (0.98 in) to 50 millimetres (1.96 in) (e.g., Apollon's Axle), and is often engraved with a knurled crosshatch pattern to help lifters maintain a solid grip. Weight plates slide onto the outer portions of the bar to increase or decrease the desired total weight. Collars are used to prevent plates from moving outward unevenly so that the lifter does not experience uneven force. \nThe barbell is the longer version of the dumbbell that is used for free weight training and competitive sports, such as powerlifting, Olympic weight lifting, and CrossFit.  Many exercises can be done using the barbell, such as bicep curl, bench press, Olympic weightlifting, overhead press, deadlift, and squat. Olympic barbells are usually an estimated weight of 20 kilograms (44 lb). Many fitness categories use the barbell for different reasons. For example, powerlifters use the barbell to perform compound exercise movements.",
  "Drag curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Hammer Curls": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Biceps curl to shoulder press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Concentration curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Dumbbell Bicep Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Cross-body hammer curl": "Body for Life (BFL) is a 12-week nutrition and exercise program, and also an annual physique transformation competition. The program utilizes a low-fat high-protein diet. It was created by Bill Phillips, a former competitive bodybuilder and  previous owner of EAS, a manufacturer of nutritional supplements. \nIt has been popularized by a bestselling book of the same name.\nMedical experts have described Body for Life as being effective, if difficult to follow. It has sometimes been described as a fad diet, but this criticism is not universal.",
  "Dumbbell Alternate Bicep Curl": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Standing concentration curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Alternate Hammer Curl": "Curling is a sport in which players slide stones on a sheet of ice toward a target area which is segmented into four concentric circles. It is related to bowls, boules, and shuffleboard. Two teams, each with four players, take turns sliding heavy, polished granite stones, also called rocks, across the ice curling sheet toward the house, a circular target marked on the ice. Each team has eight stones, with each player throwing two. The purpose is to accumulate the highest score for a game; points are scored for the stones resting closest to the centre of the house at the conclusion of each end, which is completed when both teams have thrown all of their stones once. A game usually consists of eight or ten ends.\nThe player can induce a curved path, described as curl, by causing the stone to slowly rotate as it slides. The path of the rock may be further influenced by two sweepers with brooms or brushes, who accompany it as it slides down the sheet and sweep the ice in front of the stone. \"Sweeping a rock\" decreases the friction, which makes the stone travel a straighter path (with less curl) and a longer distance. A great deal of strategy and teamwork go into choosing the ideal path and placement of a stone for each situation, and the skills of the curlers determine the degree to which the stone will achieve the desired result.",
  "Seated dumbbell biceps curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Dumbbell preacher curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Standing Dumbbell Reverse Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Face-down incline dumbbell biceps curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Plate hammer curl": "A barbell is a piece of exercise equipment used in weight training, bodybuilding, weightlifting, powerlifting and strongman, consisting of a long bar, usually with weights attached at each end.\nBarbells range in length from 1.2 metres (4 ft) to above 2.4 metres (8 ft), although bars longer than 2.2 metres (7.2 ft) are used primarily by powerlifters and are not commonplace. The central portion of the bar varies in diameter from 25 millimetres (0.98 in) to 50 millimetres (1.96 in) (e.g., Apollon's Axle), and is often engraved with a knurled crosshatch pattern to help lifters maintain a solid grip. Weight plates slide onto the outer portions of the bar to increase or decrease the desired total weight. Collars are used to prevent plates from moving outward unevenly so that the lifter does not experience uneven force. \nThe barbell is the longer version of the dumbbell that is used for free weight training and competitive sports, such as powerlifting, Olympic weight lifting, and CrossFit.  Many exercises can be done using the barbell, such as bicep curl, bench press, Olympic weightlifting, overhead press, deadlift, and squat. Olympic barbells are usually an estimated weight of 20 kilograms (44 lb). Many fitness categories use the barbell for different reasons. For example, powerlifters use the barbell to perform compound exercise movements.",
  "Overhead cable curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Standing One-Arm Cable Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Standing Biceps Cable Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Lying cable biceps curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "EZ-Bar Curl": "A barbell is a piece of exercise equipment used in weight training, bodybuilding, weightlifting, powerlifting and strongman, consisting of a long bar, usually with weights attached at each end.\nBarbells range in length from 1.2 metres (4 ft) to above 2.4 metres (8 ft), although bars longer than 2.2 metres (7.2 ft) are used primarily by powerlifters and are not commonplace. The central portion of the bar varies in diameter from 25 millimetres (0.98 in) to 50 millimetres (1.96 in) (e.g., Apollon's Axle), and is often engraved with a knurled crosshatch pattern to help lifters maintain a solid grip. Weight plates slide onto the outer portions of the bar to increase or decrease the desired total weight. Collars are used to prevent plates from moving outward unevenly so that the lifter does not experience uneven force. \nThe barbell is the longer version of the dumbbell that is used for free weight training and competitive sports, such as powerlifting, Olympic weight lifting, and CrossFit.  Many exercises can be done using the barbell, such as bicep curl, bench press, Olympic weightlifting, overhead press, deadlift, and squat. Olympic barbells are usually an estimated weight of 20 kilograms (44 lb). Many fitness categories use the barbell for different reasons. For example, powerlifters use the barbell to perform compound exercise movements.",
  "Standing barbell calf raise": "Calf raises are a method of exercising the triceps surae (gastrocnemius and soleus), tibialis posterior, and peroneal muscles of the lower leg. The movement performed is plantar flexion, also called ankle extension.",
  "Weighted donkey calf raise": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Smith Machine Calf Raise": "Calf raises are a method of exercising the triceps surae (gastrocnemius and soleus), tibialis posterior, and peroneal muscles of the lower leg. The movement performed is plantar flexion, also called ankle extension.",
  "Standing Calf Raises": "Calf raises are a method of exercising the triceps surae (gastrocnemius and soleus), tibialis posterior, and peroneal muscles of the lower leg. The movement performed is plantar flexion, also called ankle extension.",
  "Seated Calf Raise": "Calf raises are a method of exercising the triceps surae (gastrocnemius and soleus), tibialis posterior, and peroneal muscles of the lower leg. The movement performed is plantar flexion, also called ankle extension.",
  "Close-grip bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Decline barbell bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Wide-grip bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Board bench press": "John Lee Bench (born December 7, 1947) is an American former professional baseball player. He played his entire Major League Baseball career, which lasted from 1967 to 1983, with the Cincinnati Reds, primarily as a catcher. Bench was the leader of the Reds team known as the Big Red Machine that dominated the National League in the mid-1970s, winning six division titles, four National League pennants and two World Series championships.A fourteen-time All-Star and a two-time National League Most Valuable Player, Bench excelled on offense as well as on defense, twice leading the National League in home runs and three times in runs batted in. At the time of his retirement in 1983, he held the major league record for most home runs hit by a catcher. He was also the first catcher in history to lead the league in home runs. He hit 45 home runs in 1970, which was a single-season record for catchers until Salvador Perez hit 48 in 2021. His 389 home runs and 1,376 runs batted in remain the most in Cincinnati Reds history.On defense, Bench was a ten-time Gold Glove Award winner who skillfully handled pitching staffs and possessed a strong, accurate throwing arm. He caught 100 or more games for 13 consecutive seasons. In 1986, Bench was inducted into the Cincinnati Reds Hall of Fame. He was inducted into the Baseball Hall of Fame in 1989. ESPN has called him the greatest catcher in baseball history.\n\n",
  "Barbell Bench Press-Wide Grip": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Kettlebell alternating floor press": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Pushups": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Hands-elevated push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Decline Push-Up": "The decline of Christianity in the Western world is the decreasing Christian affiliation in the Western world. While most countries in the Western world were historically almost exclusively Christian, the post-World War II era has seen developed countries with modern, secular educational facilities shifting towards post-Christian, secular, globalized, multicultural and multifaith societies.\nWhile Christianity is currently the predominant religion in Latin America, Europe, Canada and the United States, the religion is declining in many of these areas, particularly in Western Europe, North America, and Australia and New Zealand. A decline in Christianity among countries in Latin America's Southern Cone has also contributed to a rise in irreligion in Latin America.In the West, since at least the mid-twentieth century there has been a gradual decline in adherence to established Christianity. In a process described as secularization, \"unchurched spirituality\" is gaining more prominence over organized religion.\n\n",
  "Close push-up to wide push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Feet-elevated push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Clock push-up": "A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year. Devices operating on several physical processes have been used over the millennia.\nSome predecessors to the modern clock may be considered \"clocks\" that are based on movement in nature: A sundial shows the time by displaying the position of a shadow on a flat surface. There is a range of duration timers, a well-known example being the hourglass. Water clocks, along with sundials, are possibly the oldest time-measuring instruments. A major advance occurred with the invention of the verge escapement, which made possible the first mechanical clocks around 1300 in Europe, which kept time with oscillating timekeepers like balance wheels.Traditionally, in horology (the study of timekeeping), the term clock was used for a striking clock, while a clock that did not strike the hours audibly was called a timepiece. This distinction is not generally made any longer. Watches and other timepieces that can be carried on one's person are usually not referred to as clocks. Spring-driven clocks appeared during the 15th century. During the 15th and 16th centuries, clockmaking flourished. The next development in accuracy occurred after 1656 with the invention of the pendulum clock by Christiaan Huygens. A major stimulus to improving the accuracy and reliability of clocks was the importance of precise time-keeping for navigation. The mechanism of a timepiece with a series of gears driven by a spring or weights is referred to as clockwork; the term is used by extension for a similar mechanism not used in a timepiece. The electric clock was patented in 1840, and electronic clocks were introduced in the 20th century, becoming widespread with the development of small battery-powered semiconductor devices.\nThe timekeeping element in every modern clock is a harmonic oscillator, a physical object (resonator) that vibrates or oscillates at a particular frequency.\nThis object can be a pendulum, a balance wheel, a tuning fork, a quartz crystal, or the vibration of electrons in atoms as they emit microwaves, the last of which is so precise that it serves as the definition of the second.\nClocks have different ways of displaying the time. Analog clocks indicate time with a traditional clock face and moving hands. Digital clocks display a numeric representation of time. Two numbering systems are in use: 12-hour time notation and 24-hour notation. Most digital clocks use electronic mechanisms and LCD, LED, or VFD displays. For the blind and for use over telephones, speaking clocks state the time audibly in words. There are also clocks for the blind that have displays that can be read by touch.",
  "Push-Up Wide": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Sphinx push-up": "An Antarctic Mystery (French: Le Sphinx des glaces, The Sphinx of the Ice Fields) is a two-volume novel by Jules Verne. Written in 1897,  it is a continuation of Edgar Allan Poe's 1838 novel The Narrative of Arthur Gordon Pym of Nantucket. It follows the adventures of the narrator and his journey from the Kerguelen Islands aboard Halbrane.\nNeither Poe nor Verne had actually visited the remote Kerguelen Islands, located in the south Indian Ocean, but their works are some of the few literary (as opposed to exploratory) references to the archipelago.",
  "Close-Hands Push-Up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Suspended push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Push Up to Side Plank": "The plank (also called a front hold, hover, or abdominal bridge) is an isometric core strength exercise that involves maintaining a position similar to a push-up for the maximum possible time.\n\n",
  "Side-to-side push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Typewriter push-up": "A typewriter is a mechanical or electromechanical machine for typing characters. Typically, a typewriter has an array of keys, and each one causes a different single character to be produced on paper by striking an inked ribbon selectively against the paper with a type element.  At the end of the nineteenth century, the term 'typewriter' was also applied to a person who used such a device.The first commercial typewriters were introduced in 1874, but did not become common in offices in the United States until after the mid-1880s. The typewriter quickly became an indispensable tool for practically all writing other than personal handwritten correspondence. It was widely used by professional writers, in offices, in business correspondence in private homes, and by students preparing written assignments.\nTypewriters were a standard fixture in most offices up to the 1980s. After that, they began to be largely supplanted by personal computers running word processing software. Nevertheless, typewriters remain common in some parts of the world. For example, typewriters are still used in many Indian cities and towns, especially in roadside and legal offices, due to a lack of continuous, reliable electricity.The QWERTY keyboard layout, developed for typewriters in the 1870s, remains the de facto standard for English-language computer keyboards. The origins of this layout still need to be clarified. Similar typewriter keyboards, with layouts optimised for other languages and orthographies, emerged soon afterward, and their layouts have also become standard for computer keyboards in their respective markets.",
  "Diamond push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Judo push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Wide push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Clapping Push-Up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Staggered push-up": "Video on demand (VOD) is a media distribution system that allows users to access videos, television shows and films without a traditional video playback device and a typical static broadcasting schedule. In the 20th century, broadcasting in the form of over-the-air programming was the most common form of media distribution. As Internet and IPTV technologies continued to develop in the 1990s, consumers began to gravitate towards non-traditional modes of content consumption, which culminated in the arrival of VOD on televisions and personal computers.Unlike broadcast television, VOD systems initially required each user to have an Internet connection with considerable bandwidth to access each system's content. In 2000, the Fraunhofer Institute IIS developed the JPEG2000 codec, which enabled the distribution of movies via Digital Cinema Packages. This technology has since expanded its services from feature-film productions to include broadcast television programmes and has led to lower bandwidth requirements for VOD applications. Disney, Paramount, Sony, Universal and Warner Bros. subsequently launched the Digital Cinema Initiative, in 2002.\nTelevision VOD systems can stream content, either through a traditional set-top box or through remote devices such as computers, tablets, and smartphones. VOD users can permanently download content to a device such as a computer, digital video recorder (DVR) or a portable media player for continued viewing. The majority of cable and telephone company–based television providers offer VOD streaming, whereby a user selects a video programme that begins to play immediately, or downloading to a DVR rented or purchased from the provider, or to a PC or to a portable device for deferred viewing.\nStreaming media has emerged as an increasingly popular medium of VOD provision. Desktop client applications such as the Apple iTunes online content store and Smart TV apps such as Amazon Prime Video allow temporary rentals and purchases of video entertainment content. Other Internet-based VOD systems provide users with access to bundles of video entertainment content rather than individual movies and shows. The most common of these systems, Netflix, Hulu, Disney+, Peacock, Max and Paramount+, use a subscription model that requires users to pay a monthly fee for access to a selection of movies, television shows, and original series. In contrast, YouTube, another Internet-based VOD system, uses an advertising-funded model in which users can access most of its video content free of cost but must pay a subscription fee for premium content. Some airlines offer VOD services as in-flight entertainment to passengers through video screens embedded in seats or externally provided portable media players.",
  "Butterfly": "Butterflies are winged insects from the lepidopteran suborder Rhopalocera, characterized by large, often brightly coloured wings that often fold together when at rest, and a conspicuous, fluttering flight. The group comprises the superfamilies Hedyloidea (moth-butterflies in the Americas) and Papilionoidea (all others). The oldest butterfly fossils have been dated to the Paleocene, about 56 million years ago, though they may have originated earlier.\nButterflies have a four-stage life cycle, and like other holometabolous insects they undergo complete metamorphosis. Winged adults lay eggs on the food plant on which their larvae, known as caterpillars, will feed. The caterpillars grow, sometimes very rapidly, and when fully developed, pupate in a chrysalis. When metamorphosis is complete, the pupal skin splits, the adult insect climbs out, expands its wings to dry, and flies off.\nSome butterflies, especially in the tropics, have several generations in a year, while others have a single generation, and a few in cold locations may take several years to pass through their entire life cycle.Butterflies are often polymorphic, and many species make use of camouflage, mimicry, and aposematism to evade their predators. Some, like the monarch and the painted lady, migrate over long distances. Many butterflies are attacked by parasites or parasitoids, including wasps, protozoans, flies, and other invertebrates, or are preyed upon by other organisms. Some species are pests because in their larval stages they can damage domestic crops or trees; other species are agents of pollination of some plants. Larvae of a few butterflies (e.g., harvesters) eat harmful insects, and a few are predators of ants, while others live as mutualists in association with ants. Culturally, butterflies are a popular motif in the visual and literary arts. The Smithsonian Institution says \"butterflies are certainly one of the most appealing creatures in nature\".",
  "Leverage Chest Press": "A fly or flye is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively).\nDue to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it.  They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.\n\n",
  "Decline Smith Press": "American decline is the idea that the United States of America is diminishing in power on a relative basis geopolitically, militarily, financially, economically, and technologically. It can also refer to absolute declines demographically, socially, morally, spiritually, culturally, in matters of healthcare, and/or on environmental issues. There has been debate over the extent of the decline, and whether it is relative or absolute.Shrinking military advantages, deficit spending, geopolitical overreach, and a shift in moral, social, and behavioral conditions have been associated with American decline. The ascent of China as a potential superpower emerged as a central concern in discussions about the decline of American influence since the late 2010s, with some scholars suggesting that China has the potential to challenge the United States' current position as the world's leading superpower, though other scholars have criticized this view. \nScholars say that the perception of decline, or declinism, has long been part of American culture.\n\n",
  "Smith machine bench press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Machine chest press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Smith Machine Incline Bench Press": "A forming press, commonly shortened to press, is a machine tool that changes the shape of a work-piece by the application of pressure. The operator of a forming press is known as a press-tool setter, often shortened to tool-setter.\nPresses can be classified according to\n\ntheir mechanism: hydraulic, mechanical, pneumatic;\ntheir function: forging presses, stamping presses, press brakes,  punch press, etc.\ntheir structure, e.g. Knuckle-joint press, screw press, Expeller press\ntheir controllability: conventional vs. servo-presses",
  "Smith Machine Close-Grip Bench Press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Smith Machine Decline Press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Smith machine bench press throw": "Kyle Elliot Korver (born March 17, 1981) is an American former professional basketball player who currently serves as the assistant general manager for the Atlanta Hawks of the National Basketball Association (NBA). He played college basketball for the Creighton Bluejays.\nKorver was drafted in the second round of the 2003 NBA draft by the New Jersey Nets. He was immediately traded to the Philadelphia 76ers. After four and a half seasons in Philadelphia, he was traded to the Utah Jazz. During his first stint with the Jazz in 2009–10, Korver shot 53.6 percent from three-point range, which set an NBA single-season three-point field goal accuracy record. In 2010, he joined the Chicago Bulls. In 2012, he was traded to the Atlanta Hawks, where in 2015 he was named an NBA All-Star. In 2017, he was traded to the Cleveland Cavaliers, where he was a member of back-to-back Finals teams. In 2018, he was traded back to the Jazz. In 2019, he signed with the Milwaukee Bucks.\nKorver ranks among the most prolific 3-point shooters in NBA history, ranking sixth all-time in 3-point field goals made and tenth all-time in 3-point field goal percentage. He is the only player to lead the NBA in three-point shooting percentage four times. Korver holds the Hawks and Jazz single-season three-point field goal percentage records and depending on the source/minimum threshold he is the Hawks career three-point percentage record-holder.",
  "Low-cable cross-over": "A high-voltage cable (HV cable) is a cable used for electric power transmission at high voltage. A cable includes a conductor and insulation. Cables are considered to be fully insulated. This means that they have a fully rated insulation system that will consist of insulation, semi-con layers, and a metallic shield. This is in contrast to an overhead line, which may include insulation but not fully rated for operating voltage (EG: tree wire). High-voltage cables of differing types have a variety of applications in instruments, ignition systems, and alternating current (AC) and direct current (DC) power transmission. In all applications, the insulation of the cable must not deteriorate due to the high-voltage stress, ozone produced by electric discharges in air, or tracking. The cable system must prevent contact of the high-voltage conductor with other objects or persons, and must contain and control leakage current. Cable joints and terminals must be designed to control the high-voltage stress to prevent the breakdown of the insulation.\nThe cut lengths of high-voltage cables may vary from several feet to thousands of feet, with relatively short cables used in apparatus and longer cables run within buildings or as buried cables in an industrial plant or for power distribution. The longest cut lengths of cable will often be submarine cables under the ocean for power transmission.\n\n",
  "Incline cable chest fly": "A fly or flye is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively).\nDue to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it.  They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.\n\n",
  "Single-arm cable cross-over": "SEACOM launched Africa's first broadband submarine cable system along the continent's Southern coasts in 2009.\nSEACOM is privately owned and operated.",
  "Cable cross-over": "The Southern Cross Cable is a trans-Pacific network of telecommunications cables commissioned in 2000. The network is operated by the Bermuda-registered company Southern Cross Cables Limited. The network has 28,900 km (18,000 mi) of submarine and 1,600 km (990 mi) of terrestrial fiber optic cables, all which operate in a triple-ring configuration. Initially, each cable had a bandwidth capacity of 120 gigabit/s. Southern Cross offers capacity services from 100M/STM-1 to 100Gbit/s OTU-4, including 1G, 10G and 40G Ethernet Private Line services.",
  "Lying cable chest fly": "A fly or flye is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively).\nDue to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it.  They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.\n\n",
  "Medicine ball push-up": "An exercise ball is a ball constructed of soft elastic, typically in 5 diameters of 10 cm increments, from 35 to 85 cm (14 to 33 in), and filled with air. The air pressure is changed by removing a valve stem and either filling with air or letting the ball deflate. It is most often used in physical therapy, athletic training and exercise. It can also be used for weight training.\nThe ball is also known by various other names, for instance: balance ball, birth ball, body ball, fitness ball, gym ball, gymnastic ball, physio ball, pilates ball, Pezzi ball, stability ball, Swedish ball, Swiss ball, therapy ball, or yoga ball.\n\n",
  "Dumbbell Bench Press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Incline dumbbell bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Reverse-grip incline dumbbell bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Neutral-grip dumbbell bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Decline dumbbell bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Single-arm kettlebell row": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Straight-arm dumbbell pull-over": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Bent-arm dumbbell pull-over": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Close-grip dumbbell bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Single-dumbbell push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Chest dip": "A dip is an upper-body strength exercise. Close grip dips primarily train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles, and the rhomboid muscles of the back. Wide shoulder width dips place additional emphasis on the pectoral muscles, similar in respect to the way a wide grip bench press would focus more on the pectorals and less on the triceps.",
  "Weighted Push-Up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Svend press": "Sweyn Forkbeard (Old Norse: Sveinn Haraldsson tjúguskegg [ˈswɛinː ˈhɑrˌɑldsˌson ˈtjuːɣoˌskeɡː]; Danish: Svend Tveskæg; 17 April 963 – 3 February 1014) was  King of Denmark from 986 until his death, King of England for five weeks from December 1013 until his death, and King of Norway from 999/1000 until 1013/14. He was the father of King Harald II of Denmark, King Cnut the Great, and Queen Estrid Svendsdatter.In the mid-980s, Sweyn revolted against his father, Harald Bluetooth, and seized the throne. Harald was driven into exile and died shortly afterwards in November 986 or 987. In 1000, with the allegiance of Eric, Earl of Lade, Sweyn ruled most of Norway. In 1013, shortly before his death, he became the first Danish king of the English after a long effort.",
  "Bar Push-Up Smith Machine": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Exercise ball chest stretch": "The following outline is provided as an overview of and topical guide to exercise:\nExercise – any bodily activity that enhances or log physical fitness and overall health and wellness. It is performed for various reasons including strengthening muscles and the cardiovascular system, honing athletic skills, weight loss or maintenance, as well as for the purpose of enjoyment. Frequent and regular physical exercise boosts the immune system, and helps prevent the \"diseases of affluence\" such as heart disease, cardiovascular disease, Type 2 diabetes and obesity.",
  "Standing behind-the-back wrist curl": "The wrist curl is a weight training exercise for developing just the wrist flexor muscles of the forearm. It is therefore an isolation exercise. Ideally, it should be done in combination with the \"reverse wrist curl\" (also called wrist extension) to ensure equal development of the wrist flexor and wrist extensor muscles.\nWrist curls can be performed with a dumbbell or with both hands holding a barbell. To perform a seated wrist curl, the lifter should be seated on a bench with knees bent and the forearm(s) resting on the thigh, or with forearms on a bench and hands hanging off the edge. The palm should be facing up and the hand should be free to move completely up and down. At the starting point, the wrist should be bent back so that the fingers are almost pointing down at the floor. In a steady motion, the lifter should raise the weight by using the forearm muscles to bring the hand up as far as possible. The forearm itself should remain resting on the thigh. Then the weight should be slowly lowered back down to the starting point.\nTo perform a standing wrist curl, a barbell can be held in both hands with the palms facing backward. The bar should be behind the lifter. The same motion should be performed as in the seated wrist curl. The range of motion will be smaller but the standing wrist curl offers the benefit of providing the most stress on the target muscles at their peak contraction.",
  "Seated palms-up wrist curl": "The wrist curl is a weight training exercise for developing just the wrist flexor muscles of the forearm. It is therefore an isolation exercise. Ideally, it should be done in combination with the \"reverse wrist curl\" (also called wrist extension) to ensure equal development of the wrist flexor and wrist extensor muscles.\nWrist curls can be performed with a dumbbell or with both hands holding a barbell. To perform a seated wrist curl, the lifter should be seated on a bench with knees bent and the forearm(s) resting on the thigh, or with forearms on a bench and hands hanging off the edge. The palm should be facing up and the hand should be free to move completely up and down. At the starting point, the wrist should be bent back so that the fingers are almost pointing down at the floor. In a steady motion, the lifter should raise the weight by using the forearm muscles to bring the hand up as far as possible. The forearm itself should remain resting on the thigh. Then the weight should be slowly lowered back down to the starting point.\nTo perform a standing wrist curl, a barbell can be held in both hands with the palms facing backward. The bar should be behind the lifter. The same motion should be performed as in the seated wrist curl. The range of motion will be smaller but the standing wrist curl offers the benefit of providing the most stress on the target muscles at their peak contraction.",
  "Seated palms-down wrist curl": "The wrist curl is a weight training exercise for developing just the wrist flexor muscles of the forearm. It is therefore an isolation exercise. Ideally, it should be done in combination with the \"reverse wrist curl\" (also called wrist extension) to ensure equal development of the wrist flexor and wrist extensor muscles.\nWrist curls can be performed with a dumbbell or with both hands holding a barbell. To perform a seated wrist curl, the lifter should be seated on a bench with knees bent and the forearm(s) resting on the thigh, or with forearms on a bench and hands hanging off the edge. The palm should be facing up and the hand should be free to move completely up and down. At the starting point, the wrist should be bent back so that the fingers are almost pointing down at the floor. In a steady motion, the lifter should raise the weight by using the forearm muscles to bring the hand up as far as possible. The forearm itself should remain resting on the thigh. Then the weight should be slowly lowered back down to the starting point.\nTo perform a standing wrist curl, a barbell can be held in both hands with the palms facing backward. The bar should be behind the lifter. The same motion should be performed as in the seated wrist curl. The range of motion will be smaller but the standing wrist curl offers the benefit of providing the most stress on the target muscles at their peak contraction.",
  "Partner farmer's walk": "Euchre or eucre () is a trick-taking card game commonly played in Australia, Canada, Great Britain, New Zealand, and the Midwestern United States. It is played with a deck of 24, 28, or 32 standard playing cards. There are normally four players, two on each team, although there are variations for two to nine players.\nEuchre emerged in the United States in the early 19th century. There are several theories regarding its origin, but the most likely is that it is derived from an old Alsatian game called Jucker or Juckerspiel. Euchre was responsible for introducing the joker into the modern deck of cards, first appearing in Euchre packs in the 1850s.Euchre has a large number of variants and has been described as \"an excellent social game.\"\n\n",
  "Dumbbell suitcase carry": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Suitcase Dumbbell Carry": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Barbell Hip Thrust": "The pelvic thrust is the thrusting motion of the pelvic region, which is used for a variety of activities, such as dance, exercise, or sexual activity.\n\n",
  "Kettlebell thruster": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Single-leg cable hip extension": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Step-up with knee raise": "Aerobics is a form of physical exercise that combines rhythmic aerobic exercise with stretching and strength training routines with the goal of improving all elements of fitness (flexibility, muscular strength, and cardio-vascular fitness). It is usually performed to music and may be practiced in a group setting led by an instructor (fitness professional). With the goal of preventing illness and promoting physical fitness, practitioners perform various routines. Formal aerobics classes are divided into different levels of intensity and complexity and will have five components: warm-up (5–10 minutes), cardiovascular conditioning (25–30 minutes), muscular strength and conditioning (10–15 minutes), cool-down (5–8 minutes) and stretching and flexibility (5–8 minutes). Aerobics classes may allow participants to select their level of participation according to their fitness level. Many gyms offer different types of aerobic classes. Each class is designed for a certain level of experience and taught by a certified instructor with a specialty area related to their particular class.\n\n",
  "Standing hip extension": "In vertebrate anatomy, the hip, or coxa(pl.: coxae) in medical terminology, refers to either an anatomical region or a joint on the outer (lateral) side of the pelvis.\nThe hip region is located lateral and anterior to the gluteal region, inferior to the iliac crest, and lateral to the obturator foramen, with muscle tendons and soft tissues overlying the greater trochanter of the femur. In adults, the three pelvic bones (ilium, ischium and pubis) have fused into one hip bone, which forms the superomedial/deep wall of the hip region.\nThe hip joint, scientifically referred to as the acetabulofemoral joint (art. coxae), is the ball-and-socket joint between the pelvic acetabulum and the femoral head. Its primary function is to support the weight of the torso in both static (e.g. standing) and dynamic (e.g. walking or running) postures. The hip joints have very important roles in retaining balance, and for maintaining the pelvic inclination angle.\nPain of the hip may be the result of numerous causes, including nervous, osteoarthritic, infectious, traumatic, and genetic.",
  "Exercise ball hip thrust": "The front kick in martial arts is a kick executed by lifting the knee straight forward, while keeping the foot and shin either hanging freely or pulled to the hip, and then straightening the leg in front of the practitioner and striking the target area. It is desirable to retract the leg immediately after delivering the kick, to avoid the opponent trying to grapple the leg and (unless a combination is in process) to return to stable fighting stance.\nThe front kick described is the typical basic front kick of karate or taekwondo. But the front kick can also be defined more broadly as a straight forward kick directly to the front, and then include several variations from many different styles. A front kick can be delivered forward in a penetrating way (hip thrust), or upwards to attack the head.\n\n",
  "Barbell Deadlift": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Sumo deadlift": "The Sumo deadlift is a variation of the conventional deadlift often adopted by powerlifters.\nThe difference between the two lies in the setup of the lifter's feet and hands. When the bar is gripped with the lifter's hands inside their legs, the form is considered \"Sumo\". Traditionally, hip stance is far wider in Sumo deadlifts, and toes are pointed slightly outwards.The Sumo deadlift may be advantageous to people with exceptional hip mobility, a long torso, or short arms, as it allows the hips to start closer to the bar, with the torso in a more upright position. Another advantage of the Sumo deadlift is decreased shearing force on the lumbar spine when compared to the conventional deadlift. Other benefits of the Sumo deadlift include: Strengthening the quadriceps, glutes, hamstrings, and other muscles of the posterior chain. In addition to building strength and muscle mass, the Sumo deadlift can be used as a rehabilitation exercise to overcome back injury.\n\n",
  "Power clean": "The clean and jerk is a composite of two weightlifting movements, most often performed with a barbell: the clean and the jerk. During the clean, the lifter moves the barbell from the floor to a racked position across the deltoids, without resting fully on the clavicles. During the jerk, the lifter raises the barbell to a stationary position above the head, finishing with straight arms and legs, and the feet in the same plane as the torso and barbell.\nOf the several variants of the lift, the most common is the Olympic clean and jerk, which, with the snatch, is included in Olympic weightlifting events.",
  "Romanian Deadlift": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Kettlebell pass-through lunge": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Single-arm kettlebell clean": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Single-leg kettlebell deadlift": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Single-arm kettlebell swing": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Romanian Deadlift With Dumbbells": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Box jump": "A jump server, jump host or jump box is a system on a network used to access and manage devices in a separate security zone. A jump server is a hardened and monitored device that spans two dissimilar security zones and provides a controlled means of access between them. The most common example is managing a host in a DMZ from trusted networks or computers.",
  "Box Jump (Multiple Response)": "Plyometrics, also known as jump training or plyos, are exercises in which muscles exert maximum force in short intervals of time, with the goal of increasing power (speed-strength). This training focuses on learning to move from a muscle extension to a contraction in a rapid or \"explosive\" manner, such as in specialized repeated jumping. Plyometrics are primarily used by athletes, especially martial artists, sprinters and high jumpers, to improve performance, and are used in the fitness field to a much lesser degree.",
  "Sled push-": "A training sled, weight sled, or fitness sled is a piece of exercise equipment that provides resistance as the user pushes, pulls, or otherwise moves the sled along a flat surface. Commercial sleds allow easily adjusting the weight or resistance and are supported on feet or wheels that allow moving the sled across surfaces such as grass, turf, or pavement without damage. Training with sleds has become increasingly popular since 2015, due in part to their availability in Crossfit gyms. Sled pulling and sled pushing are commonly used forms of training for sprinting.\n\n",
  "Hamstring slide": "Anterior cruciate ligament reconstruction (ACL reconstruction) is a surgical tissue graft replacement of the anterior cruciate ligament, located in the knee, to restore its function after an injury. The torn ligament can either be removed from the knee (most common), or preserved (where the graft is passed inside the preserved ruptured native ligament) before reconstruction through an arthroscopic procedure. ACL repair is also a surgical option. This involves repairing the ACL by re-attaching it, instead of performing a reconstruction. Theoretical advantages of repair include faster recovery and a lack of donor site morbidity, but randomised controlled trials and long-term data regarding re-rupture rates using contemporary surgical techniques are lacking.",
  "Lying Leg Curls": "The leg curl is an isolation exercise that targets the hamstring muscles. The exercise involves flexing the lower leg against resistance towards the buttocks. There are three types of leg curls. There are seated leg curls, lying leg curls, and standing leg curls.  \nOther exercises that can be used to strengthen the hamstrings include the glute-ham raise and the deadlift.\n\n",
  "Seated Leg Curl": "The leg curl is an isolation exercise that targets the hamstring muscles. The exercise involves flexing the lower leg against resistance towards the buttocks. There are three types of leg curls. There are seated leg curls, lying leg curls, and standing leg curls.  \nOther exercises that can be used to strengthen the hamstrings include the glute-ham raise and the deadlift.\n\n",
  "Standing leg swing": "A Standing Baba, or Khareshwari, is a Hindu who has vowed to stand, not sitting or lying down even to sleep. The vow is a form of Hindu Tapa (or Tapasas), a self-inflicted corporal punishment intended to help bring spiritual enlightenment. Khareshwari are primarily found in India, but are not limited to that country.\nThe length of the vow is unclear from available references. One source says that the vow lasts for twelve years. Other sources do not attach a specific time frame. \nKhareshwari traditionally stood under a tree. This may be connected to the Yoga position known as Vrikasana, the Tree Position. A seventeenth-century engraving shows some images of what may be Standing Baba.\nMore recently Khareshwari seem to stand inside. Author Gregory David Roberts places Babas inside in his description of Khareshwari in the novel Shantaram. Additionally, two online photos of Khareshwari both show men inside, not under a tree. \nThe Standing Baba have a swing-like device that allows them to rest their arms during the day. During the night, a Khareshwari will support his torso on the swing as he sleeps. The swing usually has a sling beneath it. The sling can hold one of the Khareshwari's legs at a time. It is unclear if this is intended to rest one leg or to increase the pressure on the other leg. While Khareshwaris may walk about, they usually just stand/hang in their swing. \nStanding for years at a time causes swollen legs and ulcerated feet. Roberts and others describe the Khareshwari tapa as extremely painful and even permanently disabling.\n\n",
  "Knee Tuck Jump": "An acrobatic flip is a sequence of body movements in which a person leaps into the air and then rotates one or more times while airborne. Acrobatic flips are performed in acro dance, free running, gymnastics, cheerleading, high jumping, tricking (martial arts), goal celebrations and various other activities. This is in contrast to freestyle BMX flips, in which a person revolves in the air about a bicycle.\nAcrobatic flips can be started from a stationary, standing position and they are also commonly executed immediately following another rotational move, such as a roundoff or handspring, so as to take advantage of the angular momentum developed in the preceding move. In general, the hands do not touch the floor during execution of a flip and performers typically strive to land on the feet in an upright position, but it is not required to be considered a flip.\n\n",
  "Inchworm": "The geometer moths are moths belonging to the family Geometridae of the insect order Lepidoptera, the moths and butterflies. Their scientific name derives from the Ancient Greek geo γεω (derivative form of γῆ or γαῖα \"the earth\"), and metron μέτρον \"measure\" in reference to the way their larvae, or inchworms, appear to measure the earth as they move along in a looping fashion. Geometridae is a very large family, containing around 23,000 described species; over 1400 species from six subfamilies are indigenous to North America alone. A well-known member is the peppered moth, Biston betularia, which has been the subject of numerous studies in population genetics. Several other geometer moths are notorious pests.",
  "World's greatest stretch": "Randy Walker (August 21, 1968 – November 30, 1995), better known by his stage name Stretch, was an American rapper and record producer, working in Live Squad. In the early 1990s, he joined 2Pac's rap group Thug Life. The November 30, 1994, shooting of Shakur led to their split. On November 30, 1995, Walker was shot and killed at the age of 27.\n\n",
  "Lying hamstring stretch with band": "The function of the posterior cruciate ligament (PCL) is to prevent the femur from sliding off the anterior edge of the tibia and to prevent the tibia from displacing posterior to the femur. Common causes of PCL injuries are direct blows to the flexed knee, such as the knee hitting the dashboard in a car accident or falling hard on the knee, both instances displacing the tibia posterior to the femur.Surgery to repair the posterior cruciate ligament is controversial due to its placement and technical difficulty.The posterior drawer test is one of the tests used by doctors and physiotherapists to detect injury to the PCL.\nAn additional test of posterior cruciate ligament injury is the posterior sag test, where, in contrast to the drawer test, no active force is applied. Rather, the person lies supine with the leg held by another person so that the hip is flexed to 90 degrees and the knee 90 degrees. The main parameter in this test is step-off, which is the shortest distance from the femur to a hypothetical line that tangents the surface of the tibia from the tibial tuberosity and upwards. Normally, the step-off is approximately 1 cm, but is decreased (Grade I) or even absent (Grade II) or inverse (Grade III) in injuries to the posterior cruciate ligament.Patients who are suspected to have a posterior cruciate ligament injury should always be evaluated for other knee injuries that often occur in combination with an PCL injuries. These include cartilage/meniscus injuries, bone bruises, ACL tears, fractures, posterolateral injuries and collateral ligament injuries.\n\n",
  "Exercise ball leg curl": "The following outline is provided as an overview of and topical guide to exercise:\nExercise – any bodily activity that enhances or log physical fitness and overall health and wellness. It is performed for various reasons including strengthening muscles and the cardiovascular system, honing athletic skills, weight loss or maintenance, as well as for the purpose of enjoyment. Frequent and regular physical exercise boosts the immune system, and helps prevent the \"diseases of affluence\" such as heart disease, cardiovascular disease, Type 2 diabetes and obesity.",
  "Band-assisted pull-up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
  "Assisted Chin-Up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
  "Barbell pull-over to press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Weighted pull-up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
  "Floor rope climb": "Rope climbing is a sport in which competitors attempt to climb up a suspended vertical rope using only their hands. Rope climbing is practiced regularly at the World Police and Fire Games, and is enjoying a resurgence in France, where competitions are held in shopping centers. Also, enthusiasts in the Czech Republic resurrected the sport in 1993, and hold local and national competitions.",
  "Around-the-world pull-up": "The capybara or greater capybara (Hydrochoerus hydrochaeris) is a giant cavy rodent native to South America. It is the largest living rodent and a member of the genus Hydrochoerus. The only other extant member is the lesser capybara (Hydrochoerus isthmius). Its close relatives include guinea pigs and rock cavies, and it is more distantly related to the agouti, the chinchilla, and the nutria. The capybara inhabits savannas and dense forests, and lives near bodies of water. It is a highly social species and can be found in groups as large as 100 individuals, but usually live in groups of 10–20 individuals. The capybara is hunted for its meat and hide and also for grease from its thick fatty skin.\n\n",
  "Close-grip pull-down": "Grip strength is the force applied by the hand to pull on or suspend from objects and is a specific part of hand strength. Optimum-sized objects permit the hand to wrap around a cylindrical shape with a diameter from one to three inches. Stair rails are an example of where shape and diameter are critical for proper grip in case of a fall. Other grip strengths that have been studied are the hammer and other hand tools. In applications of grip strength, the wrist must be in a neutral position to avoid developing cumulative trauma disorders.\nGrip strength is a general term also used to refer to the physical strength of an animal and, for athletes, to the muscular power and force that can be generated with the hands. In athletics, grip strength is critical for rock climbers and is an important factor in strongman competitions and weight lifting.  Grip strength training is also a major feature in martial arts and can be useful in various professions where people must work with their hands.\n\n",
  "Shotgun row": "A shotgun house is a narrow rectangular domestic residence, usually no more than about 12 feet (3.5 m) wide, with rooms arranged one behind the other and doors at each end of the house. It was the most popular style of house in the Southern United States from the end of the American Civil War (1861–65) through the 1920s.  Alternative names include shotgun shack, shotgun hut, shotgun cottage, and in the case of a multihome dwelling, shotgun apartment; the design is similar to that of railroad apartments.\nA longstanding theory is that the style can be traced from Africa to Saint Dominican influences on house design in New Orleans, but the houses can be found as far away as Key West and Ybor City in Florida, and Texas, and as far north as Chicago, Illinois. Though initially as popular with the middle class as with the poor, the shotgun house became a symbol of poverty in the mid-20th century.  Urban renewal has led to the destruction of many shotgun houses; however, in areas affected by gentrification, historic preservation efforts have led to the renovation of such houses.\nSeveral variations of shotgun houses allow for additional features and space, and many have been updated to the needs of later generations of owners. The oldest shotgun houses were built without indoor plumbing, which was often added later, often on the back of the house, sometimes crudely. \"Double-barrel\" or \"double\" shotgun houses are a semi-detached configuration, consisting of two houses sharing a central wall, allowing more houses to be fit into an area. \"Camelback\" shotgun houses include a second floor at the rear of the house. In some cases the entire floor plan is changed during remodeling to create hallways.\n\n",
  "Close-Grip Front Lat Pulldown": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Lat pull-down": "The pull-down exercise is a strength training exercise designed to develop the latissimus dorsi muscle. It performs the functions of downward rotation and depression of the scapulae combined with adduction and extension of the shoulder joint.\nThe cable lat pull-down is done where the handle is moved via a cable pulley, as opposed to doing pull-downs on a leverage machine.\n\n",
  "Single-arm kneeling lat pull-down": "Arm wrestling (also spelled armwrestling) is a sport with two opponents who face each other with their bent elbows placed on a table and hands firmly gripped, who then attempt to force the opponent's hand down to the table top (\"pin\" them). The sport is often casually used to demonstrate the stronger person between two or more people.\nIn the early years other names were used to describe the same sport, including arm turning, arm twisting, twisting wrists, wrist turning and wrist wrestling.\n\n",
  "Kneeling lat pull-down": "The pull-down exercise is a strength training exercise designed to develop the latissimus dorsi muscle. It performs the functions of downward rotation and depression of the scapulae combined with adduction and extension of the shoulder joint.\nThe cable lat pull-down is done where the handle is moved via a cable pulley, as opposed to doing pull-downs on a leverage machine.\n\n",
  "Reverse-grip lat pull-down": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Machine seated row": "In strength training, rowing (or a row, usually preceded by a qualifying adjective — for instance a cable seated row, barbell upright row, dumbbell bent-over row, T-bar rows, et cetera) is an exercise where the purpose is to strengthen the muscles that draw the rower's arms toward the body (latissimus dorsi) as well as those that retract the scapulae (trapezius and rhomboids) and those that support the spine (erector spinae).  When done on a rowing machine, rowing also exercises muscles that extend and support the legs (quadriceps and thigh muscles).  In all cases, the abdominal and lower back muscles must be used in order to support the body and prevent back injury.\nMany other weight-assisted gym exercises mimic the movement of rowing, such as the deadlift, high pull and the bent-over row.  An effective off-season training programme combines both erg pieces and weight-assisted movements similar to rowing, with an emphasis on improving endurance under high tension rather than maximum strength.\n\n",
  "Machine-assisted pull-up": "Truck and tractor pulling, also known as power pulling, is a form of a motorsport competition in which antique or modified tractors pull a heavy drag or sled along an 11-meter-wide (35 ft), 100-meter-long (330 ft) track, with the winner being the tractor that pulls the drag the farthest.  Tractor pulling is popular in certain areas of the United States, Mexico, Canada, Europe (especially in the United Kingdom, Greece, Switzerland, Sweden, Netherlands, Belgium, Italy, Denmark and Germany), Australia, Brazil, South Africa, Vietnam, India and New Zealand. The sport is known as the world's most powerful motorsport, due to the multi-engined modified tractor pullers.\nAll tractors in their respective classes pull a set weight in the drag. When a tractor gets to the end of the 100 meter track, this is known as a \"full pull\". When more than one tractor completes the course, more weight is added to the drag, and those competitors that moved past 91 metres (300 ft) will compete in a pull-off; the winner is the one who can pull the drag the farthest. The drag is known as a weight transfer drag. This means that, as it is pulled down the track, the weight is transferred (linked with gears to the drag’s wheels) from over the rear axles and towards the front of the drag. In front of the rear wheels, instead of front wheels, there is a \"pan\". This is essentially a metal plate, and as the weight moves toward it, the resistance between the pan and the ground builds. The farther the tractor pulls the drag, the more difficult it gets.\nTractor pulling originated from pre-Industrial Era horse pulling competitions in which farmers would compete with one another to see whose teams of draft horses could pull a heavy load over the longest distance. The first known competitions using motorized tractors were held in 1929 in Missouri and Kentucky. Tractor pulling became popular in rural areas across the Midwestern and Southern United States in the 1950s and 1960s. From there it gradually spread to Canada, Europe, and Australia and New Zealand. \n\n",
  "Single-arm pull-down": "Arm wrestling (also spelled armwrestling) is a sport with two opponents who face each other with their bent elbows placed on a table and hands firmly gripped, who then attempt to force the opponent's hand down to the table top (\"pin\" them). The sport is often casually used to demonstrate the stronger person between two or more people.\nIn the early years other names were used to describe the same sport, including arm turning, arm twisting, twisting wrists, wrist turning and wrist wrestling.\n\n",
  "Pullups": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
  "Pull-up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
  "Rope climb": "Top rope climbing (or top roping) is a form of rock climbing where the climber is securely attached to a climbing rope that runs through a fixed anchor at the top of the climbing route, and back down to the belayer (or \"second\") at the base of the climb. A climber who falls will just hang from the rope at the point of the fall, and can then either resume their climb or have the belayer lower them down in a controlled manner to the base of the climb. Climbers on indoor climbing walls can use mechanical auto belay devices to top rope alone.\nBy definition, top roping can only be done on routes that are less than half the length of a typical climbing rope, which means single-pitch routes that are below 25–30 metres (82–98 ft) in height. Top roping is also used in ice climbing, and the related sports of mixed climbing and dry-tooling, and it is used in combination with auto belay devices in both competition speed climbing and competition ice climbing.\nTop roping is one of the relatively safest forms of rock climbing and is used by most beginners and novices of the sport. Before the era of sport climbing, top roping a route for practice (known as headpointing or hangdogging) was considered poor practice; however, it is now a legitimate technique in preparing for a redpoint ascent. Top roping a new route is not considered a first free ascent of a climb, and because of the ability of the belayer to give aid to the climber, it is not strictly free climbing (although some advocate that with slack, it is similar to free climbing), and is thus differentiated from 'normal' lead climbing.\n\n",
  "Neutral-grip pull-up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
  "One Handed Hang": "Yoruichi Shihōin (四楓院 夜一, Shihōin Yoruichi) is a fictional character in the anime and manga series Bleach created by Tite Kubo.\n\n",
  "Standing side bend stretch": "Professional wrestling holds include a number of set moves and pins used by performers to immobilize their opponents or lead to a submission. This article covers the various pins, stretches and transition holds used in the ring. Some wrestlers use these holds as their finishing maneuvers, often nicknaming them to reflect their character or persona. Moves are listed under general categories whenever possible.",
  "Negative pull-up": "A push–pull amplifier is a type of electronic circuit that uses a pair of active devices that alternately supply current to, or absorb current from, a connected load.  This kind of amplifier can enhance both the load capacity and switching speed.\nPush–pull outputs are present in TTL and CMOS digital logic circuits and in some types of amplifiers, and are usually realized by a complementary pair of transistors, one dissipating or sinking current from the load to ground or a negative power supply, and the other supplying or sourcing current to the load from a positive power supply.\nA push–pull amplifier is more efficient than a single-ended \"class-A\" amplifier. The output power that can be achieved is higher than the continuous dissipation rating of either transistor or tube used alone and increases the power available for a given supply voltage. Symmetrical construction of the two sides of the amplifier means that even-order harmonics are cancelled, which can reduce distortion. DC current is cancelled in the output, allowing a smaller output transformer to be used than in a single-ended amplifier. However, the push–pull amplifier requires a phase-splitting component that adds complexity and cost to the system; use of center-tapped transformers for input and output is a common technique but adds weight and restricts performance. If the two parts of the amplifier do not have identical characteristics, distortion can be introduced as the two halves of the input waveform are amplified unequally.  Crossover distortion can be created near the zero point of each cycle as one device is cut off and the other device enters its active region.\n\nPush–pull circuits are widely used in many amplifier output stages.  A pair of audion tubes connected in push–pull is described in Edwin H. Colpitts' US patent 1137384 granted in 1915, although the patent does not specifically claim the push–pull connection. The technique was well known at that time  and the principle had been claimed in an 1895 patent predating electronic amplifiers. Possibly the first commercial product using a push–pull amplifier was the RCA Balanced amplifier released in 1924 for use with their Radiola III regenerative broadcast receiver.  By using a pair of low-power vacuum tubes in push–pull configuration, the amplifier allowed the use of a loudspeaker instead of headphones, while providing acceptable battery life with low standby power consumption. The technique continues to be used in audio, radio frequency, digital and power electronics systems today.\n\n",
  "Medicine ball slam": "Edward Stephen Hall (born 15 January 1988) is an British media personality and retired strongman. He is best known for his world-record setting 500 kg (1,100 lb) deadlift in 2016 which is widely regarded as one of the most important lifts in the history of strongmen. He is also known for winning the 2017 World's Strongest Man competition.Hall has won national competitions such as England's Strongest Man, Britain's Strongest Man, and UK's Strongest Man multiple times. In 2022, he was defeated by fellow World's Strongest Man winner Hafþór Júlíus Björnsson in a boxing match that was taglined \"The Heaviest Boxing Match in History\". He has presented his own television series called Eddie Eats America (2018) and was featured in the History Channel series The Strongest Man in History (2019). He had his first acting role as an extra in the action film Expend4bles (2023).\n\n",
  "Lower back SMR": "The Rolls-Royce SMR, also known as the UK SMR, is a small modular reactor (SMR) being developed by the Rolls-Royce (RR) company in the United Kingdom.\nThe company has been given financial support by the UK Government to develop its design. It is estimated that the 470 MWe units will cost around £1.8 billion once in full production, compared with £22 billion for a full-sized nuclear power station such as the planned 3,300 MWe Sizewell C. Construction time and site size needed will also be lower.",
  "Barbell deficit deadlift": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Back extension": "A back extension is an exercise that works the lower back as well as the mid and upper back, specifically the Erector spinae. Each of us have two Erector spinae muscles, one of either side of the spine that run along the entire length of the spine. Erector spinae muscles are actually formed of three smaller muscles – spinalis, longissimus, and iliocostalis.",
  "Superman": "Superman is a superhero who appears in American comic books published by DC Comics. The character was created by writer Jerry Siegel and artist Joe Shuster, and debuted in the comic book Action Comics #1 (cover-dated June 1938 and published April 18, 1938). Superman has been adapted to a number of other media, which includes radio serials, novels, films, television shows, theater, and video games.\nSuperman was born on the fictional planet Krypton with the birth name of Kal-El. As a baby, his parents sent him to Earth in a small spaceship shortly before Krypton was destroyed in a natural cataclysm. His ship landed in the American countryside near the fictional town of Smallville. He was found and adopted by farmers Jonathan and Martha Kent, who named him Clark Kent. Clark began developing various superhuman abilities, such as incredible strength and impervious skin. His adoptive parents advised him to use his powers for the benefit of humanity, and he decided to fight crime as a vigilante. To protect his personal life, he changes into a colorful costume and uses the alias \"Superman\" when fighting crime. Clark resides in the fictional American city of Metropolis, where he works as a journalist for the Daily Planet. Superman's supporting characters include his love interest and fellow journalist Lois Lane, Daily Planet photographer Jimmy Olsen, and editor-in-chief Perry White, and his enemies include Brainiac, General Zod, Darkseid, and his archenemy, Lex Luthor.\nSuperman is the archetype of the superhero: he wears an outlandish costume, uses a codename, and fights evil with the aid of extraordinary abilities. Although there are earlier characters who arguably fit this definition, it was Superman who popularized the superhero genre and established its conventions. He was the best-selling superhero in American comic books up until the 1980s.",
  "Child's pose": "Bālāsana (Sanskrit: बालासन) or Child Pose, is a kneeling asana in modern yoga as exercise. Balasana is a counter asana for various asanas and is usually practiced before and after Sirsasana.",
  "Partner Superman with alternating high-five": "Superman is a superhero who appears in American comic books published by DC Comics. The character was created by writer Jerry Siegel and artist Joe Shuster, and debuted in the comic book Action Comics #1 (cover-dated June 1938 and published April 18, 1938). Superman has been adapted to a number of other media, which includes radio serials, novels, films, television shows, theater, and video games.\nSuperman was born on the fictional planet Krypton with the birth name of Kal-El. As a baby, his parents sent him to Earth in a small spaceship shortly before Krypton was destroyed in a natural cataclysm. His ship landed in the American countryside near the fictional town of Smallville. He was found and adopted by farmers Jonathan and Martha Kent, who named him Clark Kent. Clark began developing various superhuman abilities, such as incredible strength and impervious skin. His adoptive parents advised him to use his powers for the benefit of humanity, and he decided to fight crime as a vigilante. To protect his personal life, he changes into a colorful costume and uses the alias \"Superman\" when fighting crime. Clark resides in the fictional American city of Metropolis, where he works as a journalist for the Daily Planet. Superman's supporting characters include his love interest and fellow journalist Lois Lane, Daily Planet photographer Jimmy Olsen, and editor-in-chief Perry White, and his enemies include Brainiac, General Zod, Darkseid, and his archenemy, Lex Luthor.\nSuperman is the archetype of the superhero: he wears an outlandish costume, uses a codename, and fights evil with the aid of extraordinary abilities. Although there are earlier characters who arguably fit this definition, it was Superman who popularized the superhero genre and established its conventions. He was the best-selling superhero in American comic books up until the 1980s.",
  "One-Arm Long Bar Row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Bent Over Barbell Row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Barbell seal row": "The 2015 CrossFit Games were the ninth CrossFit Games, which were held on July 21–26, 2015 at the StubHub Center in Carson, California. Ben Smith was the men's winner, and Katrin Davidsdottir was the women's winner. The Affiliate Cup was won by CrossFit Mayhem Freedom from Cookeville, Tennessee, captained by four-time individual men's champion Rich Froning Jr. who moved to team competition this year.In the 2015 season, the 17 regions of previous seasons were combined into 8 \"super-regions\" for the Regionals. This season a Teenage competition for boys and girls was added in the Open for two age groups.  The Teenage and Masters Games events were the same and took place from July 21–23.\nBoth the men's and women's competitions were closely fought at the Games. Ben Smith, a Games competitor every year since 2009, won for the first time (he placed third in 2011 and 2013), having secured the win only in the final event by holding off 2014's second-place finisher Mat Fraser who many had predicted would be the 2015 champion. In the women's competition, Iceland's Katrin Davidsdottir overtook fellow countrywoman Sara Sigmundsdóttir, who led for much of the competition, in the final event. Tia-Clair Toomey, who made her debut at this year's Games, finished second and was named Rookie of the Year.\n\n",
  "Barbell Deadlift Bent Row Complex": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Kettlebell alternating renegade row": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "One-Arm Dumbbell Row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Incline dumbbell row": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Man-maker": "Mega Man Maker (previously known as Mega Maker) is a fan made action-platform game, released in July 2017 for Microsoft Windows. Based on Capcom's Mega Man series, players are able to create and share their own Mega Man levels online such as a traditional stage from the Mega Man series, puzzle levels and automatic levels (which were made popular in Nintendo's Super Mario Maker) and are able to play other people's levels either by searching their level IDs or the level name. The available categories are \"newest\", \"oldest\", \"worst rated\", \"best rated\", \"popular\" and \"most played\" with the number of upvotes and downvotes affecting best rated and worst rated respectively. It is commonly referred as a Super Mario Maker alternative by Mega Man fans.",
  "Dumbbell bent-over row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Upside-down pull-up": "Upside Down (French: Un monde à l'envers) is a 2012 English-language Franco-Canadian romantic science fantasy film written and directed by Juan Diego Solanas and starring Jim Sturgess, Kirsten Dunst and Timothy Spall.",
  "Smith machine inverted row": "The inverted row is an exercise in calisthenics. It primarily works the muscles of the upper back—the trapezius and latissimus dorsi—as well as the biceps as a secondary muscle group. The supine row is normally carried out in three to five sets, but repetitions depend on the type of training a lifter is using to make their required gains. This exercise is lighter on the joints compared to weighted rows. The exercise can also be performed with mixed, underhand, or overhand grips with either wide or narrow hand placement. The exercise is also known under various names such as supine row, bodyweight row, Australian pull up or \"horizontal pull-up\".One study showed that the inverted row activated the latissimus dorsi muscles, upper back, and hip extensor muscles more than the standing bent-over row and also resulted in less load on the lower spine area, which makes the exercises preferable for people with lower-back issues compared to other rowing exercises.\n\n",
  "Suspended row": "As of January 1, 2023, there were 2,331 death row inmates in the United States. The number of death row inmates changes frequently with new convictions, appellate decisions overturning conviction or sentence alone, commutations, or deaths (through execution or otherwise). Due to this fluctuation as well as lag and inconsistencies in inmate reporting procedures across jurisdictions, the information in this article may present inaccuracies.\n\n",
  "Single-arm cable seated row": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Rower": "Rowing, sometimes called crew in the United States, is the sport of racing boats using oars. It differs from paddling sports in that rowing oars are attached to the boat using oarlocks, while paddles are not connected to the boat. Rowing is divided into two disciplines: sculling and sweep rowing. In sculling, each rower holds two oars, one in each hand, while in sweep rowing each rower holds one oar with both hands. There are several boat classes in which athletes may compete, ranging from single sculls, occupied by one person, to shells with eight rowers and a coxswain, called eights. There are a wide variety of course types and formats of racing, but most elite and championship level racing is conducted on calm water courses 2 kilometres (1.2 mi) long with several lanes marked using buoys.\nModern rowing as a competitive sport can be traced to the early 17th century when professional watermen held races (regattas) on the River Thames in London, England. Often prizes were offered by the London Guilds and Livery Companies. Amateur competition began towards the end of the 18th century with the arrival of \"boat clubs\" at British public schools. Similarly, clubs were formed at colleges within Oxford and Cambridge on the programme for the 1896 games, racing did not take place due to bad weather. Male rowers have competed since the 1900 Summer Olympics. Women's rowing was added to the Olympic programme in 1976. Today, there are fourteen boat classes which race at the Olympics.  \nIn addition, the sport's governing body, the World Rowing Federation, holds the annual World Rowing Championships with twenty-two boat classes.\nAcross six continents, 150 countries now have rowing federations that participate in the sport.  Major domestic competitions take place in dominant rowing nations and include The Boat Race and Henley Royal Regatta in the United Kingdom, the Australian Rowing Championships in Australia, the Harvard–Yale Regatta and Head of the Charles Regatta in the United States, and the Royal Canadian Henley Regatta in Canada. Many other competitions often exist for racing between clubs, schools, and universities in each nation.",
  "Smith machine bent-over row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Leverage High Row": "In statistics and in particular in regression analysis, leverage is a measure of how far away the independent variable values of an observation are from those of the other observations. High-leverage points, if any, are outliers with respect to the independent variables. That is, high-leverage points have no neighboring points in \n  \n    \n      \n        \n          \n            R\n          \n          \n            p\n          \n        \n      \n    \n    {\\displaystyle \\mathbb {R} ^{p}}\n   space, where \n  \n    \n      \n        \n          p\n        \n      \n    \n    {\\displaystyle {p}}\n   is the number of independent variables in a regression model. This makes the fitted model likely to pass close to a high leverage observation. Hence high-leverage points have the potential to cause large changes in the parameter estimates when they are deleted i.e., to be influential points. Although an influential point will typically have high leverage, a high leverage point is not necessarily an influential point. The leverage is typically defined as the diagonal elements of the hat matrix.",
  "Barbell shrug": "A barbell is a piece of exercise equipment used in weight training, bodybuilding, weightlifting, powerlifting and strongman, consisting of a long bar, usually with weights attached at each end.\nBarbells range in length from 1.2 metres (4 ft) to above 2.4 metres (8 ft), although bars longer than 2.2 metres (7.2 ft) are used primarily by powerlifters and are not commonplace. The central portion of the bar varies in diameter from 25 millimetres (0.98 in) to 50 millimetres (1.96 in) (e.g., Apollon's Axle), and is often engraved with a knurled crosshatch pattern to help lifters maintain a solid grip. Weight plates slide onto the outer portions of the bar to increase or decrease the desired total weight. Collars are used to prevent plates from moving outward unevenly so that the lifter does not experience uneven force. \nThe barbell is the longer version of the dumbbell that is used for free weight training and competitive sports, such as powerlifting, Olympic weight lifting, and CrossFit.  Many exercises can be done using the barbell, such as bicep curl, bench press, Olympic weightlifting, overhead press, deadlift, and squat. Olympic barbells are usually an estimated weight of 20 kilograms (44 lb). Many fitness categories use the barbell for different reasons. For example, powerlifters use the barbell to perform compound exercise movements.",
  "Kettlebell sumo deadlift high pull": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Standing dumbbell upright row": "The upright row is a weight training exercise performed by holding a weight with an overhand grip and lifting it straight up to the collarbone. This is a compound exercise that involves the trapezius, the deltoids and the biceps. The narrower the grip the more the trapezius muscles are exercised, as opposed to the deltoids.\nBarbells, dumbbells, kettlebells or a cable machine can be used.\nDue to the amount of internal rotation of the humerus during this movement, this exercise may worsen shoulder impingement syndrome.",
  "Cable straight-bar upright row": "The upright row is a weight training exercise performed by holding a weight with an overhand grip and lifting it straight up to the collarbone. This is a compound exercise that involves the trapezius, the deltoids and the biceps. The narrower the grip the more the trapezius muscles are exercised, as opposed to the deltoids.\nBarbells, dumbbells, kettlebells or a cable machine can be used.\nDue to the amount of internal rotation of the humerus during this movement, this exercise may worsen shoulder impingement syndrome.",
  "Smith machine shrug": "In weight training, the shoulder shrug (usually called simply the shrug) is an exercise used to develop the upper trapezius muscle.\n\n",
  "Smith machine behind-the-back shrug": "The Smith machine is a weight machine used for weight training. It consists of a barbell that is fixed within steel rails allowing only vertical or near-vertical movement. Some Smith machines have the barbell counterbalanced. The machine can be used for a wide variety of exercises though it is most commonly used to perform \"Smith machine squats\".",
  "Smith machine upright row": "The upright row is a weight training exercise performed by holding a weight with an overhand grip and lifting it straight up to the collarbone. This is a compound exercise that involves the trapezius, the deltoids and the biceps. The narrower the grip the more the trapezius muscles are exercised, as opposed to the deltoids.\nBarbells, dumbbells, kettlebells or a cable machine can be used.\nDue to the amount of internal rotation of the humerus during this movement, this exercise may worsen shoulder impingement syndrome.",
  "Quadriceps SMR": "The participation of women and girls in sports, physical fitness, and exercise has been recorded to have existed throughout history. However, participation rates and activities vary in accordance with nation, era, geography, and stage of economic development. While initially occurring informally, the modern era of organized sports did not begin to emerge either for women or men until the late industrial age.\nUntil roughly 1870, women's activities tended to be informal and recreational in nature, lacked rules codes, and emphasized physical activity rather than competition. Today, women's sports are more sport-specific and have developed into both amateur levels and professional levels in various places internationally, but is found primarily within developed countries where conscious organization and accumulation of wealth has occurred. In the mid-to-latter part of the 20th century, female participation in sport and the popularization of their involvement increased, particularly during its last quarter. Very few organized sports have been invented by women. Sports such as Newcomb ball, netball, acrobatic gymnastics, and tumbling, and possibly stoolball, are examples. More recent examples include Pamela Frey's sport of BasKua in Argentina, and the game of Crokicurl by Liz Wreford and Leanne Muir in Canada.\nWomen's involvement in sports is more visible in well-developed countries and today their level of participation and performance still varies greatly by country and by sport. Despite an increase in women's participation in sport, the male demographic is still the larger of the two. These demographic differences are observed globally. Female dominated sports are the one exception. Girls' participation in sports tend to be higher in the United States than in other parts of the world like Western Europe and Latin America. Girls' participation in more violent contact sports is far less than that of their male counterparts.\n\nTwo important divisions exist in relation to female sporting categories. These sports either emerged exclusively as an organized female sport or were developed as an organized female variant of a sport first popularized by a male demographic and therefore became a female category. In all but a few exceptional cases, such as in the case of camogie, a female variant, or \"women's game\" uses the same name of the sport popularly played by men, but is classified into a different category which is differentiated by sex: men's or women's, or girls or boys. Female variants are widely common while organized female sports by comparison are rare and include team sports such as netball, throwball, artistic (née synchronized) swimming, and ringette. In female sports, the supposed benefits of gender parity, gender equity, and gender equality feminism are controversial.\nExcept in a few rare cases like women's professional tennis, professional women's sport rarely provide competitors with a livable income. In addition, competing for media coverage of the women's variant of a sport which is primarily popular among males, creates complex barriers. More recently, there has been an increasing amount of interest, research, investment and production in regards to equipment design for female athletes. Interest and research involving the identification of sex-specific injuries, particularly though not exclusively among high performance female athletes, has increased as well, such as in the case of concussions and the female athlete triad, a.k.a. \"Relative energy deficiency in sport\" (RED-S).At times female athletes have engaged in social activism in conjunction with their participation in sport. Protest methods have included playing strikes, social media campaigns, and in the case of America, federal lawsuits on grounds of inequality, usually as it relates to gender parity principles, American law and Title IX which demand schools that any funds given to support students' sports should be equally distributed between boys and girls. Public service oriented promotional campaigns for girls in sport involve a variety of media campaign styles.",
  "Barbell Full Squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell back squat to box": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Push-press": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
  "Power snatch-": "The snatch is the first of two lifts contested in the sport of weightlifting (also known as Olympic weightlifting) followed by the clean and jerk. The objective of the snatch is to lift the barbell from the ground to overhead in one continuous motion. There are four main styles of snatch used: snatch (or full snatch), split snatch, power snatch, and muscle snatch.  The full lift is the most common style used in competition, while power snatches and muscle snatches are mostly used for training purposes, and split snatches are rarely used. Any of these lifts can be performed from the floor, from the hang position, or from blocks. In competition, only lifts from the floor are allowed. \nIn the snatch, the lifter lifts the bar as high as possible and pulls themselves under it in a squat position, receiving the bar overhead with the arms straight, decreasing the necessary height of the bar, therefore increasing the amount of weight that the lifter may successfully lift. The lifter finally straightens to a fully upright position with the bar above their head and arms fully extended.\nIn the split snatch, the lifter lifts the bar as high as possible and pulls themselves under the bar similar to the squat snatch but in the split snatch the lifter \"splits\" their legs, placing one foot in front of them and one behind, allowing themselves to receive the bar lower as in the squat snatch. The split snatch has become much less common but is occasionally performed by some lifters.\nIn the power snatch, the lifter lifts the barbell as high as possible and receives the bar overhead with only a slight bend in the knee and hip, increasing the height that the bar must be lifted and decreasing the amount of weight that may be successfully lifted. \nIn the muscle snatch, the lifter lifts the bar all the way overhead with arms locked out and the hip and knee fully extended.",
  "Barbell Squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell front squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell step-up": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Barbell Bulgarian split squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Hack Squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell thruster": "The 2023 CrossFit Games is the 17th edition of the premier competition in the sport of CrossFit held from August 1 to August 6, 2023, in Madison, Wisconsin. The winners were Laura Horvath for the women's competition, Jeffrey Adler for the men's, and CrossFit Invictus for the team's.The qualification process for the 2023 CrossFit Games was adjusted this season, and a worldwide ranking of athletes was introduced for the determination additional qualifying spots for the CrossFit Games. All the workouts for the semifinals will also be standardized and programmed by CrossFit.  This Games is the final one to be held in Madison, Wisconsin since it was first held there in 2017. The prize purse increased to $2.945 million this year, with the winners receiving $315,000.This year a number of top female athletes from 2022 did not compete at the Games, including the women champion Tia-Clair Toomey due to pregnancy, and the runner-up Mal O'Brien. Laura Horvath trailed Emma Lawson for large part of the Games, but managed three consecutive wins in the last four events to capture her first title at the Games. The 2022 runner-up Roman Khrennikov led for most the Games, but injured his foot in the final day of competition, and finished third to the eventual winner Jeffrey Adler. After several years of absence, ESPN returned as broadcaster for the Games with live coverage on ESPN, ESPN2 and ESPN+.",
  "Push-jerk": "The clean and jerk is a composite of two weightlifting movements, most often performed with a barbell: the clean and the jerk. During the clean, the lifter moves the barbell from the floor to a racked position across the deltoids, without resting fully on the clavicles. During the jerk, the lifter raises the barbell to a stationary position above the head, finishing with straight arms and legs, and the feet in the same plane as the torso and barbell.\nOf the several variants of the lift, the most common is the Olympic clean and jerk, which, with the snatch, is included in Olympic weightlifting events.",
  "Barbell back squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Zercher squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell side split squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell Squat To A Bench": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell front squat to back squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Front Squat (Bodybuilder)": "Ronald Dean Coleman (born May 13, 1964) is an American retired professional bodybuilder. The winner of the Mr. Olympia title for eight consecutive years, he is widely regarded as either the greatest bodybuilder of all time or one of the two greatest along with Arnold Schwarzenegger and as the most dominant bodybuilding physique ever to grace the stage. Winner of 26 IFBB professional titles, he is also renowned for his combination of size and conditioning, dominant body-parts and extremely heavy workouts, making him the strongest bodybuilder of all time.For his dominance and legacy in the world of bodybuilding, Coleman was inducted into the International Sports Hall of Fame in 2016 and was bestowed with the 'Arnold Classic Lifetime Achievement Award' in 2021.\n\n",
  "Single-arm kettlebell overhead squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Kettlebell side squat": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Kettlebell sumo squat": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Kettlebell thruster progression": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Kettlebell power clean": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Single Arm Overhead Kettlebell Squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Split Squat with Dumbbells": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Dumbbell sumo squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Dumbbell step-up": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
  "Dumbbell thruster": "The 1897 pattern infantry officers’ sword is a straight-bladed, three-quarter basket-hilted sword that has been the regulation sword for officers of the line infantry of the British Army from 1897 to the present day.",
  "Dumbbell lateral hop": "Plyometrics, also known as jump training or plyos, are exercises in which muscles exert maximum force in short intervals of time, with the goal of increasing power (speed-strength). This training focuses on learning to move from a muscle extension to a contraction in a rapid or \"explosive\" manner, such as in specialized repeated jumping. Plyometrics are primarily used by athletes, especially martial artists, sprinters and high jumpers, to improve performance, and are used in the fitness field to a much lesser degree.",
  "Dumbbell jump squat": "The burpee, a squat thrust with an additional stand between repetitions, is a full body exercise used in strength training. The movement itself is primarily an anaerobic exercise, but when done in succession over a longer period can be utilized as an aerobic exercise.The basic movement as described by its namesake, physiologist Royal H. Burpee, is performed in four steps from a standing position and known as a \"four-count burpee\":\nMove into a squat position with your hands on the ground.\nKick your feet back into an extended plank position, while keeping your arms extended.\nImmediately return your feet into squat position.\nStand up from the squat position.You can make this exercise modified by stepping back into a plank instead \nMoves 2 and 3 constitute a squat thrust. Many variants of the basic burpee exist, and they often include a push-up and a jump.\n\n",
  "Hex-bar deadlift": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground.  It is one of the three powerlifting exercises, along with the squat and bench press, as well as a frequent lift in strongman.\n\nTwo styles of deadlift are commonly used in competition settings: the conventional deadlift and the sumo deadlift. While both of these styles are permitted under the rules of powerlifting, only the conventional stance is permitted in strongman. \n\n",
  "Weighted sissy squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Barbell squat with plate slide": "A barbell is a piece of exercise equipment used in weight training, bodybuilding, weightlifting, powerlifting and strongman, consisting of a long bar, usually with weights attached at each end.\nBarbells range in length from 1.2 metres (4 ft) to above 2.4 metres (8 ft), although bars longer than 2.2 metres (7.2 ft) are used primarily by powerlifters and are not commonplace. The central portion of the bar varies in diameter from 25 millimetres (0.98 in) to 50 millimetres (1.96 in) (e.g., Apollon's Axle), and is often engraved with a knurled crosshatch pattern to help lifters maintain a solid grip. Weight plates slide onto the outer portions of the bar to increase or decrease the desired total weight. Collars are used to prevent plates from moving outward unevenly so that the lifter does not experience uneven force. \nThe barbell is the longer version of the dumbbell that is used for free weight training and competitive sports, such as powerlifting, Olympic weight lifting, and CrossFit.  Many exercises can be done using the barbell, such as bicep curl, bench press, Olympic weightlifting, overhead press, deadlift, and squat. Olympic barbells are usually an estimated weight of 20 kilograms (44 lb). Many fitness categories use the barbell for different reasons. For example, powerlifters use the barbell to perform compound exercise movements.",
  "Suspended split squat": "Powerlifting is a strength sport that consists of three attempts at maximal weight on three lifts: squat, bench press, and deadlift. As in the sport of Olympic weightlifting, it involves the athlete attempting a maximal weight single-lift effort of a barbell loaded with weight plates. Powerlifting evolved from a sport known as \"odd lifts\", which followed the same three-attempt format but used a wider variety of events, akin to strongman competition. Eventually, odd lifts became standardized to the current three.\nIn competition, lifts may be performed equipped or un-equipped (typically referred to as 'classic' or 'raw' lifting in the IPF specifically). Equipment in this context refers to a supportive bench shirt or squat/deadlift suit or briefs. In some federations, knee wraps are permitted in the equipped but not un-equipped division; in others, they may be used in both equipped and un-equipped lifting. Weightlifting belts, knee sleeves, wrist wraps, and special footwear may also be used, but are not considered when distinguishing equipped from un-equipped lifting.Competitions take place across the world. Powerlifting has been a Paralympic sport (bench press only) since 1984 and, under the IPF, is also a World Games sport. Local, national and international competitions have also been sanctioned by other federations operating independently of the IPF.",
  "Dumbbell walking lunge-": "A lunge can refer to any position of the human body where one leg is positioned forward with knee bent and foot flat on the ground while the other leg is positioned behind. It is used by athletes in cross-training for sports, by weight-trainers as a fitness exercise, and by practitioners of yoga as part of an asana regimen.\nIn contrast to the split squat exercise, during the lunge the rear leg is also activated.",
  "Single-Leg Press": "The leg press is a compound weight training exercise in which the individual pushes a weight or resistance away from them using their legs. The term leg press machine refers to the apparatus used to perform this exercise. The leg press can be used to evaluate an athlete's overall lower body strength (from the gluteus Maximus to the lower leg muscles). It can help to build squat strength. If performed correctly, the inclined leg press can help develop knees to manage heavier free weights, on the other hand, it has the potential to inflict grave injury: the knees could bend the wrong way if they are locked during the exercise.It can be performed in variations, for example with one leg, or attaching bands to the leg press.\n\n",
  "Leg Press": "The leg press is a compound weight training exercise in which the individual pushes a weight or resistance away from them using their legs. The term leg press machine refers to the apparatus used to perform this exercise. The leg press can be used to evaluate an athlete's overall lower body strength (from the gluteus Maximus to the lower leg muscles). It can help to build squat strength. If performed correctly, the inclined leg press can help develop knees to manage heavier free weights, on the other hand, it has the potential to inflict grave injury: the knees could bend the wrong way if they are locked during the exercise.It can be performed in variations, for example with one leg, or attaching bands to the leg press.\n\n",
  "Elliptical trainer": "An elliptical trainer or cross-trainer is a stationary exercise machine used to stair climb, walk, or run without causing excessive pressure to the joints, hence decreasing the risk of impact injuries. For this reason, people with some injuries can use an elliptical to stay fit, as the low impact affects them little. Elliptical trainers offer a non-impact cardiovascular workout that can vary from light to high intensity based on the speed of the exercise and the resistance preference set by the user.\nElliptical trainers first entered the market in the 1990s, invented by Precor.Most elliptical trainers work the user's upper and lower body (although some models do not have moving upper body components). Though elliptical trainers are considered to be minimal-impact, they are an example of a weight-bearing form of exercise. They can be self-powered by user-generated motion or need to be plugged in for adjustment of motion and/or for supplying their electronic consoles and resistance systems.",
  "Narrow-stance leg press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Stairmaster": "StairMaster is an American company specializing in the design and production of fitness equipment. They sell cardiovascular and strength equipment such as stair climbing machines, TreadClimber cardio machines and dumbbell sets. The Stairmaster was so widely used that people referred to nearly all other brands of step climbers as StairMasters.",
  "Smith machine back squat": "The Smith machine is a weight machine used for weight training. It consists of a barbell that is fixed within steel rails allowing only vertical or near-vertical movement. Some Smith machines have the barbell counterbalanced. The machine can be used for a wide variety of exercises though it is most commonly used to perform \"Smith machine squats\".",
  "Leg Extensions": "The leg extension is a resistance weight training exercise that targets the quadriceps muscle (m. quadriceps femoris) in the legs. The exercise is done using a machine called the Leg Extension Machine. There are various manufacturers of these machines and each one is slightly different. Most gym and weight rooms will have the machine in their facility. The leg extension is an isolated exercise targeting one specific muscle group, the quadriceps. It should not be considered as a total leg workout, such as the squat or deadlift.The exercise consists of bending the leg at the knee and extending the legs, then lowering them back to the original position.\n\n",
  "Treadmill running": "A treadmill is a device generally used for walking, running, or climbing while staying in the same place. Treadmills were introduced before the development of powered machines to harness the power of animals or humans to do work, often a type of mill operated by a person or animal treading the steps of a treadwheel to grind grain. In later times, treadmills were used as punishment devices for people sentenced to hard labour in prisons. The terms treadmill and treadwheel were used interchangeably for the power and punishment mechanisms.\nMore recently, treadmills have instead been used as exercise machines for running or walking in one place. Rather than the user powering a mill, the device provides a moving platform with a wide conveyor belt driven by an electric motor or a flywheel. The belt moves to the rear, requiring the user to walk or run at a speed matching the belt. The rate at which the belt moves is the rate of walking or running. Thus, the speed of running may be controlled and measured. The more expensive, heavy-duty versions are motor-driven (usually by an electric motor). The simpler, lighter, and less expensive versions passively resist the motion, moving only when walkers push the belt with their feet. The latter are known as manual treadmills.\nTreadmills continue to be the biggest-selling exercise equipment category by a large margin. As a result, the treadmill industry has hundreds of manufacturers throughout the world.",
  "Stationary bike": "A stationary bicycle (also known as exercise bicycle, exercise bike, spinning bike, spin bike, or exercycle) is a device used as exercise equipment for indoor cycling. It includes a saddle, pedals, and some form of handlebars arranged as on a (stationary) bicycle.A stationary bicycle is usually a special-purpose exercise machine resembling a bicycle without wheels. It is also possible to adapt an ordinary bicycle for stationary exercise by placing it on bicycle rollers or a trainer. Rollers and trainers are often used by racing cyclists to warm up before racing, or to train on their own machines indoors.",
  "Treadmill jogging": "Jogging is a form of trotting or running at a slow or leisurely pace. The main intention is to increase physical fitness with less stress on the body than from faster running but more than walking, or to maintain a steady speed for longer periods of time. Performed over long distances, it is a form of aerobic endurance training.",
  "Smith machine leg press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Seated Leg Press": "The leg press is a compound weight training exercise in which the individual pushes a weight or resistance away from them using their legs. The term leg press machine refers to the apparatus used to perform this exercise. The leg press can be used to evaluate an athlete's overall lower body strength (from the gluteus Maximus to the lower leg muscles). It can help to build squat strength. If performed correctly, the inclined leg press can help develop knees to manage heavier free weights, on the other hand, it has the potential to inflict grave injury: the knees could bend the wrong way if they are locked during the exercise.It can be performed in variations, for example with one leg, or attaching bands to the leg press.\n\n",
  "Smith machine pistol squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
  "Jumping rope": "A skipping rope  or jump rope  is a tool used in the sport of skipping/jump rope where one or more participants jump over a rope swung so that it passes under their feet and over their heads. There are multiple subsets of skipping/jump rope, including single freestyle, single speed, pairs, three-person speed (Double Dutch), and three-person freestyle (Double Dutch freestyle).\nRope skipping is commonly performed as an exercise or recreational activity, and there are also many major organizations that support jump rope as a competitive sport. Often separated by sex and age, events include hundreds of competitive teams all around the world. In the US, schools rarely have jump rope teams, and few states have sanctioned official events at the elementary school level. In freestyle events, jumpers use a variety of basic and advanced techniques in a routine of one minute, which is judged by a head judge, content judges, and performance judges. In speed events, a jumper alternates their feet with the rope going around the jumper every time one of their feet hits the ground for 30 seconds, one minute, or three minutes. The jumper is judged on the number of times the right foot touches the ground in those times.",
  "Forward lunge": "A lunge can refer to any position of the human body where one leg is positioned forward with knee bent and foot flat on the ground while the other leg is positioned behind. It is used by athletes in cross-training for sports, by weight-trainers as a fitness exercise, and by practitioners of yoga as part of an asana regimen.\nIn contrast to the split squat exercise, during the lunge the rear leg is also activated.",
  "Side-to-side box skip": "13 Reasons Why is an American teen drama television series developed for Netflix by Brian Yorkey, based on the 2007 novel Thirteen Reasons Why by Jay Asher. During the course of the series, 49 episodes of 13 Reasons Why were released over four seasons, between March 31, 2017, and June 5, 2020.\n\n",
  "Broad jump": "The long jump is a track and field event in which athletes combine speed, strength and agility in an attempt to leap as far as possible from a takeoff point.  Along with the triple jump, the two events that measure jumping for distance as a group are referred to as the \"horizontal jumps\". This event has a history in the ancient Olympic Games and has been a modern Olympic event for men since the first Olympics in 1896 and for women since 1948.\n\n",
  "Burpee": "The burpee, a squat thrust with an additional stand between repetitions, is a full body exercise used in strength training. The movement itself is primarily an anaerobic exercise, but when done in succession over a longer period can be utilized as an aerobic exercise.The basic movement as described by its namesake, physiologist Royal H. Burpee, is performed in four steps from a standing position and known as a \"four-count burpee\":\nMove into a squat position with your hands on the ground.\nKick your feet back into an extended plank position, while keeping your arms extended.\nImmediately return your feet into squat position.\nStand up from the squat position.You can make this exercise modified by stepping back into a plank instead \nMoves 2 and 3 constitute a squat thrust. Many variants of the basic burpee exist, and they often include a push-up and a jump.\n\n",
  "Scissors Jump": "The scissors is a style used in the athletics event of high jump.\n\n",
  "Jumping jack-": "A jumping jack, also known as a star jump and called a side-straddle hop in the US military, is a physical jumping exercise performed by jumping to a position with the legs spread wide and the hands going overhead, sometimes in a clap, and then returning to a position with the feet together and the arms at the sides.\nThe name origin for the jumping jack exercise has sometimes erroneously been identified as World War I U.S. General John J. \"Black Jack\" Pershing, who is said to have developed the exercise, but in fact the name comes from the jumping jack children's toy, which makes similar arm swing and leg splay motions when the strings are tugged.\nAlthough he played no part in inventing the exercise, the late fitness expert Jack LaLanne was given credit for popularizing it in the United States. LaLanne used the jumping exercise during routines he promoted in decades of television fitness programming.",
  "Treadmill walking": "A treadmill is a device generally used for walking, running, or climbing while staying in the same place. Treadmills were introduced before the development of powered machines to harness the power of animals or humans to do work, often a type of mill operated by a person or animal treading the steps of a treadwheel to grind grain. In later times, treadmills were used as punishment devices for people sentenced to hard labour in prisons. The terms treadmill and treadwheel were used interchangeably for the power and punishment mechanisms.\nMore recently, treadmills have instead been used as exercise machines for running or walking in one place. Rather than the user powering a mill, the device provides a moving platform with a wide conveyor belt driven by an electric motor or a flywheel. The belt moves to the rear, requiring the user to walk or run at a speed matching the belt. The rate at which the belt moves is the rate of walking or running. Thus, the speed of running may be controlled and measured. The more expensive, heavy-duty versions are motor-driven (usually by an electric motor). The simpler, lighter, and less expensive versions passively resist the motion, moving only when walkers push the belt with their feet. The latter are known as manual treadmills.\nTreadmills continue to be the biggest-selling exercise equipment category by a large margin. As a result, the treadmill industry has hundreds of manufacturers throughout the world.",
  "Depth jump box jump": "Plyometrics, also known as jump training or plyos, are exercises in which muscles exert maximum force in short intervals of time, with the goal of increasing power (speed-strength). This training focuses on learning to move from a muscle extension to a contraction in a rapid or \"explosive\" manner, such as in specialized repeated jumping. Plyometrics are primarily used by athletes, especially martial artists, sprinters and high jumpers, to improve performance, and are used in the fitness field to a much lesser degree.",
  "Jump Squat": "Squatting is a versatile posture where the weight of the body is on the feet but the knees and hips are bent. In contrast, sitting involves supporting the weight of the body on the ischial tuberosities of the pelvis, with the lower buttocks in contact with the ground or a horizontal object. The angle between the legs when squatting can vary from zero to widely splayed out, flexibility permitting. Another variable may be the degree of forward tilt of the upper body from the hips. Squatting may be either full or partial.\nCrouching is usually considered to be synonymous with squatting. It is common to squat with one leg and kneel with the other leg. One or both heels may be up when squatting. Young children often instinctively squat. Among Chinese, Southeast Asian and Eastern European adults, squatting often takes the place of sitting or standing.",
  "Split Jump": "A split jump is a sequence of body movements in which a split is performed after jumping, while the performer is still in the air. Split jumps are commonly found in dance, figure skating, and gymnastics, and may also be used as a form of exercise.\n\n",
  "Skip": "A ship  is a large vessel that travels the world's oceans and other navigable waterways, carrying cargo or passengers, or in support of specialized missions, such as defense, research and fishing. Ships are generally distinguished from boats, based on size, shape, load capacity and purpose. Ships have supported exploration, trade, warfare, migration, colonization, and science. Ship transport is responsible for the largest portion of world commerce.\nThe word ship has meant, depending on the era and the context, either just a large vessel or specifically a ship-rigged sailing ship with three or more masts, each of which is square-rigged.\nAs of 2016, there were more than 49,000 merchant ships, totaling almost 1.8 billion deadweight tons. Of these 28% were oil tankers, 43% were bulk carriers, and 13% were container ships.The earliest historical evidence of boats is found in Egypt during the 4th millennium BCE.",
  "Kneeling hip flexor stretch": "The acetabular labrum (glenoidal labrum of the hip joint or cotyloid ligament in older texts) is a fibrocartilaginous ring which surrounds the circumference of the acetabulum of the hip, deepening the acetabulum. The labrum is attached onto the bony rim and transverse acetabular ligament. It is triangular in cross-section (with the apex represented by the free margin).The labrum contributes to the articular surface of the joint (increasing it by almost 10%). It embraces the femoral head, holding it firmly in the joint socket to stabilise the joint. It thus also seals the joint cavity, facilitating even distribution of synovial fluid so that friction is reduced and dissolved nutrients are better distributed.The anterior portion of the labrum is most susceptible to tears.\n\n",
  "Lying quad stretch with band": "Rotational–vibrational spectroscopy is a branch of molecular spectroscopy that is concerned with infrared and Raman spectra of molecules in the gas phase. Transitions involving changes in both vibrational and rotational states can be abbreviated as rovibrational (or ro-vibrational) transitions. When such transitions emit or absorb photons (electromagnetic radiation), the frequency is proportional to the difference in energy levels and can be detected by certain kinds of spectroscopy. Since changes in rotational energy levels are typically much smaller than changes in vibrational energy levels, changes in rotational state are said to give fine structure to the vibrational spectrum. For a given vibrational transition, the same theoretical treatment as for pure rotational spectroscopy gives the rotational quantum numbers, energy levels, and selection rules. In linear and spherical top molecules, rotational lines are found as simple progressions at both higher and lower frequencies relative to the pure vibration frequency. In symmetric top molecules the transitions are classified as parallel when the dipole moment change is parallel to the principal axis of rotation, and perpendicular when the change is perpendicular to that axis. The ro-vibrational spectrum of the asymmetric rotor water is important because of the presence of water vapor in the atmosphere.",
  "Southpaw sprawl": "Southpaw Grammar is the fifth studio album by English alternative rock singer Morrissey, released on 28 August 1995 by record labels RCA in the UK and Reprise in the US.\nThe album charted at number 4 in the UK and number 66 in the US, but received a mixed response from critics. The singles lifted from the album were \"Dagenham Dave\" (which reached number 26 in the UK Singles Chart in August 1995) and \"The Boy Racer\" (which reached number 36 in December).\n\n",
  "Jump lunge heel kick": "Strikes can be offensive moves in professional wrestling, that can sometimes be used to set up an opponent for a hold or for a throw. There are a wide variety of strikes in pro wrestling, and many are known by several different names. Professional wrestlers frequently give their finishers new names. Occasionally, these names become popular and are used regardless of the wrestler performing the technique.\nProfessional wrestling contains a variety of punches and kicks found in martial arts and other fighting sports; the moves listed below are more specific to wrestling itself. Many of the moves below can also be performed from a raised platform (the top rope, the ring apron, etc.); these are called aerial variations. Moves are listed under general categories whenever possible.",
  "High knees": "Knee highs are hosiery that cover the feet and legs up to the knee. A fashion accessory for casual and classic cool or warm weather apparel. Typically worn by women in many societies, they are sometimes worn with modern semi-formal attire. Unlike ordinary socks, they are generally made of nylon or other stocking materials. There were also different types and uses of knee highs for women.Knee highs became popular during the 1960s and 1970s, worn in regular knee high length or top of the knee length so they could be folded over at the top, with the increase in popularity of the mini dress and miniskirt. This style continued throughout the 1980s with above the knee and at the knee length dresses. And in the '80s they were worn not only with boat shoes and flats but also with sneakers that could be worn both dressy or casual. They come in many colors and patterns and transparency levels. They are more popular in cold weather, because they keep the feet and lower legs warm. They are sometimes worn with dresses or skirts whose hemline is below the knee, and with trousers and leggings to keep the feet warm, and with boots to catch perspiration; and sometimes form part of girls' school uniforms.",
  "Jumping Jack": "A jumping jack, also known as a star jump and called a side-straddle hop in the US military, is a physical jumping exercise performed by jumping to a position with the legs spread wide and the hands going overhead, sometimes in a clap, and then returning to a position with the feet together and the arms at the sides.\nThe name origin for the jumping jack exercise has sometimes erroneously been identified as World War I U.S. General John J. \"Black Jack\" Pershing, who is said to have developed the exercise, but in fact the name comes from the jumping jack children's toy, which makes similar arm swing and leg splay motions when the strings are tugged.\nAlthough he played no part in inventing the exercise, the late fitness expert Jack LaLanne was given credit for popularizing it in the United States. LaLanne used the jumping exercise during routines he promoted in decades of television fitness programming.",
  "Running lunge": "Longeing  (US English, classical spelling) or lungeing (UK English, informal US)  is a technique for training and exercising horses. It is also a critical component of the sport of equestrian vaulting.\nThe horse is asked to work at the end of a long line of approximately 25 feet (7.6 m). Longeing is performed on a large circle with the horse traveling around the outside edge of a real or imaginary ring with the handler on the ground in the center, holding the line. The horse is asked to respond to commands from the handler or trainer, usually given by voice, aided by pressure and release of the line and movement of a whip with a long shaft and equally long lash, called a longeing whip or longe whip.\nLongeing is used as a training tool for young horses to introduce them to commands, equipment, and to build trust and respect in the trainer. It can also be used to good effect to build strength in ridden horses or for rehabilitation after illness or injury.  It can be used to introduce new riders to the movement of a horse without having the rider also have to manage control of the animal.  It also can be an advanced riding exercise to increase balance and skill of more experienced riders.\n\n",
  "In-out jump squat": "A jumping jack, also known as a star jump and called a side-straddle hop in the US military, is a physical jumping exercise performed by jumping to a position with the legs spread wide and the hands going overhead, sometimes in a clap, and then returning to a position with the feet together and the arms at the sides.\nThe name origin for the jumping jack exercise has sometimes erroneously been identified as World War I U.S. General John J. \"Black Jack\" Pershing, who is said to have developed the exercise, but in fact the name comes from the jumping jack children's toy, which makes similar arm swing and leg splay motions when the strings are tugged.\nAlthough he played no part in inventing the exercise, the late fitness expert Jack LaLanne was given credit for popularizing it in the United States. LaLanne used the jumping exercise during routines he promoted in decades of television fitness programming.",
  "Speed skater": "Speed skating is a competitive form of ice skating in which the competitors race each other in travelling a certain distance on skates. Types of speed skating are long-track speed skating, short-track speed skating, and marathon speed skating. In the Olympic Games, long-track speed skating is usually referred to as just \"speed skating\", while short-track speed skating is known as \"short track\". The International Skating Union (ISU), the governing body of competitive ice sports, refers to long track as \"speed skating\" and short track as \"short track skating\".\nAn international federation was founded in 1892, the first for any winter sport. The sport enjoys large popularity in the Netherlands, Norway and South Korea. There are top international rinks in a number of other countries, including Canada, the United States, Germany, Italy, Japan, Russia, Kazakhstan, China, Belarus and Poland. A World Cup circuit is held with events in those countries plus two events in the Thialf ice hall in Heerenveen, Netherlands.",
  "Jumping knee up-down": "A knee strike (commonly referred to simply as a knee) is a strike with the knee, either with the kneecap or the surrounding area. Kneeing is a disallowed practice in many combat sports, especially to the head of a downed opponent.  Styles such as kickboxing and several mixed martial arts organizations allow kneeing depending on the positioning of the fighters. Knee strikes are native to the traditional Southeast Asian martial arts and traditional Okinawan martial arts.",
  "Medicine ball ninja": "A ninja (Japanese: 忍者, lit. 'one who is invisible'; [ɲiꜜɲdʑa]) or shinobi (Japanese: 忍び, lit. 'one who sneaks'; [ɕinobi]) was a covert agent, mercenary, or guerrilla warfare expert in feudal Japan. The functions of a ninja included siege and infiltration, ambush, reconnaissance, espionage, deception, and later bodyguarding and their fighting skills in martial arts, including ninjutsu. Their covert methods of waging irregular warfare were deemed dishonorable and beneath the honor of the samurai. Though shinobi proper, as specially trained warriors, spies, and mercenaries, appeared in the 15th century during the Sengoku period, antecedents may have existed as early as the 12th century.In the unrest of the Sengoku period, jizamurai families, that is, elite peasant-warriors, in Iga Province and the adjacent Kōka District formed ikki – \"revolts\" or \"leagues\" – as a means of self-defense. They became known for their military activities in the nearby regions and sold their services as mercenaries and spies. It is from these areas that much of the knowledge regarding the ninja is drawn. Following the unification of Japan under the Tokugawa shogunate in the 17th century, the ninja faded into obscurity. A number of shinobi manuals, often based on Chinese military philosophy, were written in the 17th and 18th centuries, most notably the Bansenshūkai (1676).By the time of the Meiji Restoration (1868), shinobi had become a topic of popular imagination and mystery in Japan. Ninja figured prominently in legend and folklore, where they were associated with legendary abilities such as invisibility, walking on water, and control over natural elements. Much of their perception in popular culture is based on such legends and folklore, as opposed to the covert actors of the Sengoku period.",
  "Smith machine lunge sprint": "The following outline is provided as an overview of and topical guide to exercise:\nExercise – any bodily activity that enhances or log physical fitness and overall health and wellness. It is performed for various reasons including strengthening muscles and the cardiovascular system, honing athletic skills, weight loss or maintenance, as well as for the purpose of enjoyment. Frequent and regular physical exercise boosts the immune system, and helps prevent the \"diseases of affluence\" such as heart disease, cardiovascular disease, Type 2 diabetes and obesity.",
  "Wall ball toss": "Dwarf-tossing, also called midget-tossing, is a pub/bar attraction or activity in which people with dwarfism, wearing special padded clothing or Velcro costumes, are thrown onto mattresses or at Velcro-coated walls. Participants compete to throw the person with dwarfism the furthest. Dwarf-tossing was started in Australia as a form of pub entertainment in the early 1980s. A related, formerly practiced activity was dwarf-bowling, in which a person with dwarfism was placed on a skateboard and used as a bowling ball.Since its inception in the 1980s, the activity, due to its problematic name and nature, has been highly controversial and remains so in the early 21st century.\n\n",
  "Band Pull Apart": "\"FeelingPulledApartByHorses\" and \"TheHollowEarth\" are songs by Thom Yorke, produced by Nigel Godrich. The songs were self-released as a limited double A-side vinyl in September 2009 and as a download on 6 October 2009.\n\"FeelingPulledApartByHorses\" began as a Radiohead song, and was first performed in 2001. Yorke later performed it with his bands Atoms for Peace and the Smile. \"TheHollowEarth\" came from the recording sessions for Yorke's album The Eraser (2006).\n\n",
  "Clean and press": "The clean and press is a two-part weight training exercise whereby a loaded barbell is lifted from the floor to the shoulders (the clean) and pushed overhead (the press). The lift was a component of the sport of Olympic weightlifting from 1928 to 1972, but was removed due to difficulties in judging proper technique.\n\n",
  "Clean and jerk": "The clean and jerk is a composite of two weightlifting movements, most often performed with a barbell: the clean and the jerk. During the clean, the lifter moves the barbell from the floor to a racked position across the deltoids, without resting fully on the clavicles. During the jerk, the lifter raises the barbell to a stationary position above the head, finishing with straight arms and legs, and the feet in the same plane as the torso and barbell.\nOf the several variants of the lift, the most common is the Olympic clean and jerk, which, with the snatch, is included in Olympic weightlifting events.",
  "Military press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Standing Bradford press": "Bradford is a city in West Yorkshire, England. It became a municipal borough in 1847, received a city charter in 1897 and, since the 1974 reform, the city status has belonged to the larger City of Bradford metropolitan borough. It had a population of 349,561 at the 2011 census; the second-largest subdivision of the West Yorkshire Built-up Area after Leeds, which is approximately 9 miles (14 km) to the east. The borough had a population of 546,976, making it the 9th most populous district in England.\nHistorically part of the West Riding of Yorkshire, the city grew in the 19th century as an international centre of textile manufacture, particularly wool. It was a boomtown of the Industrial Revolution, and amongst the earliest industrialised settlements, rapidly becoming the \"wool capital of the world\"; this in turn gave rise to the nicknames \"Woolopolis\" and \"Wool City\". Lying in the eastern foothills of the Pennines, the area's access to supplies of coal, iron ore and soft water facilitated the growth of a manufacturing base, which, as textile manufacture grew, led to an explosion in population and was a stimulus to civic investment. There is a large amount of listed Victorian architecture in the city including the grand Italianate city hall.From the mid-20th century, deindustrialisation caused the city's textile sector and industrial base to decline and, since then, it has faced similar economic and social challenges to the rest of post-industrial Northern England, including poverty, unemployment and social unrest. It is the third-largest economy within the Yorkshire and the Humber region at around £10 billion, which is mostly provided by financial and manufacturing industries. It is also a tourist destination, the first UNESCO City of Film and it has the National Science and Media Museum, a city park, the Alhambra theatre and Cartwright Hall. The city is the UK City of Culture for 2025 having won the designation on 31 May 2022.\n\n",
  "Barbell Shoulder Press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Barbell rear delt bent-over row": "The rear delt raise, also known as the rear deltoid raise, or rear shoulder raise  is an exercise in weight training. This exercise is an isolation exercise that heavily works the posterior deltoid muscle. The movement is primarily limited to the two shoulder joints: the glenohumeral joint and the scapulothoracic joint. Scapular movement will also cause movement in the sternoclavicular joint and acromioclavicular joint. If the elbow bends during the extension exercises, it gravitates into a rowing motion.\n\n",
  "Barbell upright row": "In strength training, rowing (or a row, usually preceded by a qualifying adjective — for instance a cable seated row, barbell upright row, dumbbell bent-over row, T-bar rows, et cetera) is an exercise where the purpose is to strengthen the muscles that draw the rower's arms toward the body (latissimus dorsi) as well as those that retract the scapulae (trapezius and rhomboids) and those that support the spine (erector spinae).  When done on a rowing machine, rowing also exercises muscles that extend and support the legs (quadriceps and thigh muscles).  In all cases, the abdominal and lower back muscles must be used in order to support the body and prevent back injury.\nMany other weight-assisted gym exercises mimic the movement of rowing, such as the deadlift, high pull and the bent-over row.  An effective off-season training programme combines both erg pieces and weight-assisted movements similar to rowing, with an emphasis on improving endurance under high tension rather than maximum strength.\n\n",
  "Lying rear delt fly": "The rear delt raise, also known as the rear deltoid raise, or rear shoulder raise  is an exercise in weight training. This exercise is an isolation exercise that heavily works the posterior deltoid muscle. The movement is primarily limited to the two shoulder joints: the glenohumeral joint and the scapulothoracic joint. Scapular movement will also cause movement in the sternoclavicular joint and acromioclavicular joint. If the elbow bends during the extension exercises, it gravitates into a rowing motion.\n\n",
  "Machine Shoulder (Military) Press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Standing Barbell Press Behind Neck": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Barbell front raise": "The front raise exercise is used in weight training. It primarily works the anterior deltoid and the clavicular head of the pectoralis major through the use of arm abduction and flexion through the frontal plane. The training volume, or number of sets and repetitions performed, depends on the lifter's training program and goals.\n\n",
  "Overhead bar front raise": "The leg raise is a strength training exercise which targets the iliopsoas (the anterior hip flexors). Because the abdominal muscles are used isometrically to stabilize the body during the motion, leg raises are also often used to strengthen the rectus abdominis muscle and the internal and external oblique muscles.",
  "Behind-the-head push-press": "A push press is a weight training exercise for the anterior head of the deltoid (shoulder).\n\n",
  "Single-arm kettlebell push-press": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Single-arm kettlebell snatch": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Single-arm kettlebell clean and jerk": "The clean and jerk is a composite of two weightlifting movements, most often performed with a barbell: the clean and the jerk. During the clean, the lifter moves the barbell from the floor to a racked position across the deltoids, without resting fully on the clavicles. During the jerk, the lifter raises the barbell to a stationary position above the head, finishing with straight arms and legs, and the feet in the same plane as the torso and barbell.\nOf the several variants of the lift, the most common is the Olympic clean and jerk, which, with the snatch, is included in Olympic weightlifting events.",
  "Double Kettlebell Push Press": "Kettlebell Sport lifting (Russian: гиревой спорт, girevoy sport, GS) a.k.a. Girya is a repetitive weight lifting sport performed with kettlebells in a given period of time.Competitive kettlebell lifting has a long history in Russia and Eastern Europe, but developed as an organised, standard sport under the name kettlebell lifting during the 1960s.",
  "Double-kettlebell windmill": "In weight training, a kettlebell is a cast-iron or cast-steel ball with a handle attached to the top (resembling a cannonball with a handle). It is used to perform many types of exercises, including   ballistic exercises that combine  cardiovascular, strength and  flexibility training.\nKettlebells are the primary equipment used in the weight-lifting sport of kettlebell lifting.\n\n",
  "Dumbbell front raise to lateral raise": "A fly or flye is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively).\nDue to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it.  They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.\n\n",
  "Single-arm palm-in dumbbell shoulder press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Standing palms-in shoulder press": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Standing dumbbell shoulder press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Single-arm lateral raise": "The triceps, or triceps brachii (Latin for \"three-headed muscle of the arm\"), is a large muscle on the back of the upper limb of many vertebrates. It consists of 3 parts: the medial, lateral, and long head. It is the muscle principally responsible for extension of the elbow joint (straightening of the arm).",
  "Overhead dumbbell front raise": "The leg raise is a strength training exercise which targets the iliopsoas (the anterior hip flexors). Because the abdominal muscles are used isometrically to stabilize the body during the motion, leg raises are also often used to strengthen the rectus abdominis muscle and the internal and external oblique muscles.",
  "Single-dumbbell front raise": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Arnold press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Single-arm standing shoulder press": "Arm wrestling (also spelled armwrestling) is a sport with two opponents who face each other with their bent elbows placed on a table and hands firmly gripped, who then attempt to force the opponent's hand down to the table top (\"pin\" them). The sport is often casually used to demonstrate the stronger person between two or more people.\nIn the early years other names were used to describe the same sport, including arm turning, arm twisting, twisting wrists, wrist turning and wrist wrestling.\n\n",
  "Dumbbell front raise": "The front raise exercise is used in weight training. It primarily works the anterior deltoid and the clavicular head of the pectoralis major through the use of arm abduction and flexion through the frontal plane. The training volume, or number of sets and repetitions performed, depends on the lifter's training program and goals.\n\n",
  "Bent-over dumbbell rear delt row": "The rear delt raise, also known as the rear deltoid raise, or rear shoulder raise  is an exercise in weight training. This exercise is an isolation exercise that heavily works the posterior deltoid muscle. The movement is primarily limited to the two shoulder joints: the glenohumeral joint and the scapulothoracic joint. Scapular movement will also cause movement in the sternoclavicular joint and acromioclavicular joint. If the elbow bends during the extension exercises, it gravitates into a rowing motion.\n\n",
  "Incline dumbbell front raise": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Side Lateral Raise": "Larry Dee Scott (October 12, 1938 – March 8, 2014), nicknamed \"The Legend\" and \"The Golden Boy,\" was an American IFBB professional bodybuilder. He won the inaugural 1965 Mr. Olympia competition and defended the crown at the 1966 Mr. Olympia contest before retiring.\n\n",
  "Dumbbell external shoulder rotation": "A fly or flye is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively).\nDue to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it.  They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.\n\n",
  "Single-arm incline lateral raise": "The triceps, or triceps brachii (Latin for \"three-headed muscle of the arm\"), is a large muscle on the back of the upper limb of many vertebrates. It consists of 3 parts: the medial, lateral, and long head. It is the muscle principally responsible for extension of the elbow joint (straightening of the arm).",
  "Seated rear delt fly": "A machine fly, alternatively called a seated lever fly or \"pec deck\" fly is a strength training exercise based on the free weight chest fly. As with the chest fly, the hand and arm move through an arc while the elbow is kept at a constant angle. Flyes are used to work the muscles of the upper body, primarily the sternal head of the  pectoralis major.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively). Denie Walter is credited with calling it the Peck Dec back in the 1970s.\n\n",
  "Seated Side Lateral Raise": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Dumbbell Lying Rear Lateral Raise": "The rear delt raise, also known as the rear deltoid raise, or rear shoulder raise  is an exercise in weight training. This exercise is an isolation exercise that heavily works the posterior deltoid muscle. The movement is primarily limited to the two shoulder joints: the glenohumeral joint and the scapulothoracic joint. Scapular movement will also cause movement in the sternoclavicular joint and acromioclavicular joint. If the elbow bends during the extension exercises, it gravitates into a rowing motion.\n\n",
  "Head-on-bench dumbbell rear delt raise": "The rear delt raise, also known as the rear deltoid raise, or rear shoulder raise  is an exercise in weight training. This exercise is an isolation exercise that heavily works the posterior deltoid muscle. The movement is primarily limited to the two shoulder joints: the glenohumeral joint and the scapulothoracic joint. Scapular movement will also cause movement in the sternoclavicular joint and acromioclavicular joint. If the elbow bends during the extension exercises, it gravitates into a rowing motion.\n\n",
  "Cuban press": "Press freedom is an ongoing issue in Cuba. The country has ranked low on the Press Freedom Index, a list published by Reporters Without Borders which reflects the degree of freedom that journalists, news organisations, and netizens have in a country. Cuba has been ranked among the index's  “least free\" countries for a decade. In 2016, Amnesty International reported that the re-establishment of diplomatic relations between the United States and Cuba in December 2014 \"renewed hope for an end to the US economic embargo, which has had a direct impact on the human rights of ordinary Cubans.\"The Cuban constitution recognizes the freedom of the press, and prohibits private ownership of the media. \"Only 25 percent of Cubans use the internet, while only five percent of homes are connected\", making it one of the Americas' least-connected countries. A number of websites are blocked, and access to information is scarce. Non-governmental organizations, such as Amnesty International, UN Special Rapporteurs, have had their access to Cuba restricted.\nOn the island, critics of the government and activists often have their mobile and internet connections tapped. Around the time of Pope Benedict XVI's 2012 visit, the government blocked NGO communications from abroad to prevent them from obtaining information on Cuban prisoners.",
  "Single-arm dumbbell upright row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Car driver": "Car and Driver (CD or C/D) is an American automotive enthusiast magazine first published in 1955. In 2006 its total circulation was 1.23 million. It is owned by Hearst Magazines, who purchased it from its prior owner Hachette Filipacchi Media U.S. in 2011. It was founded as  Sports Cars Illustrated.  The magazine is based in Ann Arbor, Michigan.",
  "Battle ropes": "Battling ropes (also known as battle ropes or heavy ropes) are used for fitness training to increase full body strength and conditioning. They were designed by John Brookfield in 2006, who developed the system around his backyard. The battling rope can be alternatively used as a resistance training technique. After its development, he taught the system to Special Forces, the Cincinnati Bengals, and the Olympic wrestling team. Since then, the training system has increased in popularity and has expanded to mainstream gyms.Battling ropes have numerous advantages including the fact they are safe, easy to use, and increase power output. With one battle rope per upper extremity, they also work out each arm independently, overcoming strength imbalances. It also reduces orthopedic load on joints.Battling ropes are thick, heavy and strong in order to give significant resistance, and there are numerous types of ropes used. The ropes typically have two common diameters (25 mm and 44 mm) and common standard lengths (5 m, 10 m, and 25 m). Some battle ropes now have a flexible metal core, making them heavier, shorter and allowing the user to move during training without being restricted by an anchor point.",
  "Bar shoulder extension stretch": "The lying triceps extension, also known as skull crusher and French extension or French press, is a strength exercise used in many different forms of strength training. It is one of the most stimulating exercises to the entire triceps muscle group in the upper arm, and works the triceps from the elbow all the way to the latissimus dorsi. Due to its full use of the triceps muscle group, the lying triceps extensions are used by many as part of their training regimen.\nTriceps extensions are isolation exercises, meaning they use just one joint. They can also be beneficial for fixing imbalances in the triceps or rehabilitating from injury. In bodybuilding, this exercise is used to target the triceps for growth.A study sponsored and done by the American Council on Exercise revealed that the extensions are around 70–90 percent effective compared to the triangle push up for the triceps. However, extensions put no pressure on the wrists so they are an alternative for people with wrist strain or injury. Despite the name, skull crushers are a safe, manageable way to effectively work the triceps.\n\n",
  "Plate shoulder circle big to small": "Pinoy Big Brother: Unlimited was a Philippine reality show based on the Big Brother franchise.\nBelow is a chronology of events that occurred over the course of the season from October 29, 2011, to March 31, 2012. This article also lists voluntary and temporary exits, entrances of houseguests, visitors, new housemates, and other events that affected the housemates' lives inside the House. October 29, 2011 is considered Day 1.",
  "Waiter's carry": "A waiters' race is a race that tests the speed that a waiter can carry a loaded tray without tipping it.",
  "Single-arm cable front raise": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Seated face pull": "The face pull is a weight training exercise that primarily targets the musculature of the upper back and shoulders, namely the posterior deltoids, trapezius, rhomboids, as well as the infraspinatus and teres minor muscles of the rotator cuff. The face pull is considered an important exercise for shoulder health and stability.\n\n",
  "Standing face pull": "The face pull is a weight training exercise that primarily targets the musculature of the upper back and shoulders, namely the posterior deltoids, trapezius, rhomboids, as well as the infraspinatus and teres minor muscles of the rotator cuff. The face pull is considered an important exercise for shoulder health and stability.\n\n",
  "Standing cable rear delt row": "The rear delt raise, also known as the rear deltoid raise, or rear shoulder raise  is an exercise in weight training. This exercise is an isolation exercise that heavily works the posterior deltoid muscle. The movement is primarily limited to the two shoulder joints: the glenohumeral joint and the scapulothoracic joint. Scapular movement will also cause movement in the sternoclavicular joint and acromioclavicular joint. If the elbow bends during the extension exercises, it gravitates into a rowing motion.\n\n",
  "Standing Low-Pulley Deltoid Raise": "The human shoulder is made up of three bones: the clavicle (collarbone), the scapula (shoulder blade), and the humerus (upper arm bone) as well as associated muscles, ligaments and tendons.  \nThe articulations between the bones of the shoulder make up the shoulder joints. The shoulder joint, also known as the glenohumeral joint, is the major joint of the shoulder, but can more broadly include the acromioclavicular joint. \nIn human anatomy, the shoulder joint comprises the part of the body where the humerus attaches to the scapula, and the head sits in the glenoid cavity. The shoulder is the group of structures in the region of the joint.The shoulder joint is the main joint of the shoulder.  It is a ball and socket joint that allows the arm to rotate in a circular fashion or to hinge out and up away from the body.  The joint capsule is a soft tissue envelope that encircles the glenohumeral joint and attaches to the scapula, humerus, and head of the biceps. It is lined by a thin, smooth synovial membrane. The rotator cuff is a group of four muscles that surround the shoulder joint and contribute to the shoulder's stability. The muscles of the rotator cuff are supraspinatus, subscapularis, infraspinatus, and teres minor. The cuff adheres to the glenohumeral capsule and attaches to the humeral head.\nThe shoulder must be mobile enough for the wide range actions of the arms and hands, but stable enough to allow for actions such as lifting, pushing, and pulling.",
  "Standing crossed-cable rear delt fly": "A fly or flye is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body.  Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively).\nDue to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it.  They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.\n\n",
  "Smith machine shoulder press": "The Smith machine is a weight machine used for weight training. It consists of a barbell that is fixed within steel rails allowing only vertical or near-vertical movement. Some Smith machines have the barbell counterbalanced. The machine can be used for a wide variety of exercises though it is most commonly used to perform \"Smith machine squats\".",
  "Machine shoulder press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Single-arm Smith machine upright row": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting.",
  "Handstand push-up": "The handstand push-up (press-up) - also called the vertical push-up (press-up) or the inverted push-up (press-up) also called \"commandos\"- is a type of push-up exercise where the body is positioned in a handstand. For a true handstand, the exercise is performed free-standing, held in the air. To prepare the strength until one has built adequate balance, the feet are often placed against a wall, held by a partner, or secured in some other way from falling. Handstand pushups require significant strength, as well as balance and control if performed free-standing.\n\n",
  "Cross-body shoulder stretch": "Rounded shoulder posture (RSP), also known as “mom posture”, is a common postural problem in which the resting position of the shoulders leans forward from the body’s ideal alignment. Patients usually feel slouched and hunched, with the situation deteriorating if left untreated. A 1992 study concluded that 73% of workers aged 20 to 50 years have a right rounded shoulder, and 66% of them have a left rounded shoulder. It is commonly believed that digitalisation combined with the improper use of digital devices have resulted in the prevalence of sedentary lifestyles, which contribute to bad posture. Symptoms of RSP will lead to upper back stiffness, neck stiffness and shoulder stiffness. It can be diagnosed by several tests, including physical tests and imaging tests. To prevent RSP from worsening, maintaining a proper posture, doing regular exercise, and undergoing therapeutic treatments could be effective. If the situation worsens, patients should seek help from medical practitioners for treatments. If RSP is left untreated, chronic pain, reduction in lung capacity and worsened psychosocial health are likely to be resulted.",
  "Arm circle": "In mathematics, a unit circle is a circle of unit radius—that is, a radius of 1.  Frequently, especially in trigonometry, the unit circle is the circle of radius 1 centered at the origin (0, 0) in the Cartesian coordinate system in the Euclidean plane. In topology, it is often denoted as S1 because it is a one-dimensional unit n-sphere.If (x, y) is a point on the unit circle's circumference, then |x| and |y| are the lengths of the legs of a right triangle whose hypotenuse has length 1. Thus, by the Pythagorean theorem, x and y satisfy the equation\n\nSince x2 = (−x)2 for all x, and since the reflection of any point on the unit circle about the x- or y-axis is also on the unit circle, the above equation holds for all points (x, y) on the unit circle, not only those in the first quadrant.\nThe interior of the unit circle is called the open unit disk, while the interior of the unit circle combined with the unit circle itself is called the closed unit disk.\nOne may also use other notions of \nother \"unit circles\", such as the Riemannian circle; see the article on mathematical norms for additional examples.",
  "Hand Stand Push-Up": "Pushing hands, Push hands or tuishou (alternately spelled tuei shou or tuei sho) is a two-person training routine practiced in internal Chinese martial arts such as baguazhang, xingyiquan, tai chi, and yiquan.  It is also played as an international sport akin to judo, sumo and wrestling, such as in Taiwan, where the biannual Tai Chi World Cup is held.",
  "Wall walk": "A chemin de ronde (French, \"round path\"' or \"patrol path\"; French pronunciation: [ʃəmɛ̃ də ʁɔ̃d]), also called an allure, alure or, more prosaically, a wall-walk, is a raised protected walkway behind a castle battlement.In early fortifications, high castle walls were difficult to defend from the ground. The chemin de ronde was devised as a walkway allowing defenders to patrol the tops of ramparts, protected from the outside by the battlements or a parapet, placing them in an advantageous position for shooting or dropping.",
  "Wall shoulder tap": "This is a list of types of threaded fasteners, including both screws and bolts.\n\n",
  "Shadow boxing": "Shadowboxing is a combat sport exercise in which a person throws punches at the air as though there is an opponent. Practised primarily in boxing, it is used mainly to prepare the muscles before the person training engages in stronger physical activity. Muhammad Ali once performed a now famous shadowboxing routine next to Howard Cosell for ABC's Wide World of Sports television cameras. Black Nova Scotian boxer George Dixon is widely credited for developing the technique.",
  "Wall sprawl": "Mixed martial arts (MMA) is a full-contact combat sport based on striking, grappling and ground fighting, incorporating techniques from various combat sports from around the world. The first documented use of the term mixed martial arts was in a review of UFC 1 by television critic Howard Rosenberg in 1993.During the early 20th century, various interstylistic contests took place throughout Japan and in the countries of the East Asia. At the same time, in Brazil, there was a phenomenon called vale tudo, which became known for unrestricted fights between various styles such as judo/Brazilian jiu-jitsu, catch wrestling/luta livre, Muay Thai, and capoeira. Another precursor to modern MMA was the 1976 Ali vs. Inoki exhibition bout (which ended in a draw after 15 rounds), fought between boxer Muhammad Ali and wrestler Antonio Inoki in Japan, where it later inspired the foundation of Shooto in 1985, Pancrase in 1993, and the Pride Fighting Championships in 1997.\nIn the 1990s, the Gracie family brought their Brazilian jiu-jitsu style, first developed in Brazil from the 1920s, to the United States – which culminated in the founding of the Ultimate Fighting Championship (UFC) promotion company in 1993. The company held an event with almost no rules, mostly due to the influence of Art Davie and Rorion Gracie attempting to replicate vale tudo fights that existed in Brazil and would later implement a different set of rules (example: eliminating kicking a grounded opponent), which differed from other leagues which were more in favour of realistic, street like fights.Originally promoted as a competition to find the most effective martial arts for real unarmed combat, competitors from different fighting styles were pitted against one another in contests with relatively few rules. Later, individual fighters incorporated multiple martial arts into their style. MMA promoters were pressured to adopt additional rules to increase competitors' safety, to comply with sport regulations and to broaden mainstream acceptance of the sport. Following these changes, the sport has seen increased popularity with a pay-per-view business that rivals boxing and professional wrestling.",
  "Incline face-down bar front raise": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Behind-the-head skullcrusher": "Tales of Arcadia is a trilogy of animated science fantasy television series created for Netflix by Guillermo del Toro and produced by DreamWorks Animation and Double Dare You. The series comprising the trilogy follows the inhabitants of the small suburban town of Arcadia Oaks, which is secretly home to various supernatural creatures and the young heroes who fight against the forces of evil that lurk in the shadows.\nThe three installments of the trilogy, Trollhunters, 3Below and Wizards, have been released worldwide.Since its release, the franchise has been widely praised as an ambitious and boundary-pushing animated series, with Filmink's Travis Johnson calling it \"the best children's animation to come along since Avatar: The Last Airbender.\"  Trollhunters was nominated for nine Daytime Emmy Awards in 2017, winning more than any other animated or live-action television program that year, and the trilogy has been twice nominated for the Emmy for Outstanding Children's Animated Series. It has also received or been nominated for a BAFTA Award, several Annie Awards, Golden Reel Awards, a Saturn Award, and twice won the Kidscreen Award of \"Best New Series\" for the first and final chapters, Trollhunters and Wizards. The franchise has been critically acclaimed for its high-quality CGI animation, its dark emotional and mature tone and complex writing, voice acting, representation of Latin Americans and immigrants, themes of prejudice, music, humor, and characters.\nThe show has also spawned several original children's books and has been adapted into a series of graphic novels by Marc Guggenheim and Richard Hamilton released by Dark Horse, and a video game titled Trollhunters: Defenders of Arcadia, released on PlayStation 4, Xbox One, Nintendo Switch and Microsoft Windows.In August 2020, it was announced the trilogy would be concluded with a full-length feature film titled Trollhunters: Rise of the Titans, which was released to Netflix on July 21, 2021.\n\n",
  "Reverse-grip bench press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Dumbbell floor press": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Single-arm dumbbell triceps extension": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Standing Bent-Over One-Arm Dumbbell Triceps Extension": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "V-sit with overhead triceps extension": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.",
  "Body Triceps Press Using Flat Bench": "The bench press, or chest press, is a weight training exercise where a person presses a weight upwards while lying horizontally on a weight training bench. Although the bench press is a compound movement, the muscles primarily used are the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.The barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and the squat. These are the only lifts in the sport of Paralympic powerlifting. The bench press is also extensively used in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it closely correlates to punching power. To improve upper body strength, power, and endurance for athletic, occupational, and functional performance as well as muscle development, the barbell bench press is frequently used.",
  "Cable V-bar push-down": "A push-down is a strength training exercise used for strengthening the triceps muscles in the back of the arm. This exercise can also be called a triceps push-down or a two-armed standing triceps extension.\nThe exercise is completed by pushing an object downward against resistance. This exercise is an example of the primary function of the triceps, the extension of the elbow joint.\nThere are multiple variations to the push-down that will target the triceps muscle in different ways.\nRope push-down is a variation that involves connecting a rope attachment to a cable machine. While executing a rope push-down, the palms face in and the arms internally rotate while pushing down. This variation works all three parts of the triceps, but especially the lateral head (coloured yellow Figure 2).\nStraight bar push-down is a variation that involves connecting a straight bar attachment to a cable machine. In executing this variation, the bar is gripped with the knuckles facing up and the elbows are held close to the body. This variation targets the long head of the triceps (coloured red in Figure 2).V-bar push-down is a combination of a rope push-down and a straight bar push-down. This variation uses a V-bar attachment connected to a cable machine and is executed with the elbows held close to the body.. This variation targets all three heads of the triceps.\nPush-downs can also be executed with resistance bands, alternating single-armed, and with varying grips.\n\n",
  "Kneeling cable triceps extension": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Single-arm cable triceps extension": "The triceps, or triceps brachii (Latin for \"three-headed muscle of the arm\"), is a large muscle on the back of the upper limb of many vertebrates. It consists of 3 parts: the medial, lateral, and long head. It is the muscle principally responsible for extension of the elbow joint (straightening of the arm).",
  "Dip Machine": "A dip is an upper-body strength exercise. Close grip dips primarily train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles, and the rhomboid muscles of the back. Wide shoulder width dips place additional emphasis on the pectoral muscles, similar in respect to the way a wide grip bench press would focus more on the pectorals and less on the triceps.",
  "Low cable overhead triceps extension": "Vincent Anselmo Gironda (November 9, 1917 – October 18, 1997) was an American professional bodybuilder, personal trainer, author, co-founder of the supplement company NSP Nutrition, and owner of the celebrity-frequented Vince's Gym. His nickname was the \"Iron Guru\".\n\n",
  "Lying cable triceps extension": "The triceps, or triceps brachii (Latin for \"three-headed muscle of the arm\"), is a large muscle on the back of the upper limb of many vertebrates. It consists of 3 parts: the medial, lateral, and long head. It is the muscle principally responsible for extension of the elbow joint (straightening of the arm).",
  "Cable overhead triceps extension": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Single-arm low cable triceps extension": "The triceps, or triceps brachii (Latin for \"three-headed muscle of the arm\"), is a large muscle on the back of the upper limb of many vertebrates. It consists of 3 parts: the medial, lateral, and long head. It is the muscle principally responsible for extension of the elbow joint (straightening of the arm).",
  "Machine Triceps Extension": "This is a partial list of weight training exercises organized by muscle groups.\n\n",
  "Triceps dip": "A dip is an upper-body strength exercise. Close grip dips primarily train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles, and the rhomboid muscles of the back. Wide shoulder width dips place additional emphasis on the pectoral muscles, similar in respect to the way a wide grip bench press would focus more on the pectorals and less on the triceps.",
  "Parallel Bar Dip": "A dip is an upper-body strength exercise. Close grip dips primarily train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles, and the rhomboid muscles of the back. Wide shoulder width dips place additional emphasis on the pectoral muscles, similar in respect to the way a wide grip bench press would focus more on the pectorals and less on the triceps.",
  "Ring dip": "A dip is an upper-body strength exercise. Close grip dips primarily train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles, and the rhomboid muscles of the back. Wide shoulder width dips place additional emphasis on the pectoral muscles, similar in respect to the way a wide grip bench press would focus more on the pectorals and less on the triceps.",
  "Russian Bar Dip": "A dip or dip sauce is a common condiment for many types of food.  Dips are used to add flavor or texture to a food, such as pita bread, dumplings, crackers, chopped raw vegetables, fruits, seafood, cubed pieces of meat and cheese, potato chips, tortilla chips, falafel, and sometimes even whole sandwiches in the case of jus. Unlike other sauces, instead of applying the sauce to the food, the food is typically placed or dipped into the sauce.\nDips are commonly used for finger foods, appetizers, and other food types. Thick dips based on sour cream, crème fraîche, milk, yogurt, mayonnaise, soft cheese, or beans are a staple of American hors d'oeuvres and are thicker than spreads, which can be thinned to make dips.  Celebrity chef Alton Brown suggests that a dip is defined based on its ability to \"maintain contact with its transport mechanism over three feet [1 m] of white carpet\".Dips in various forms are eaten all over the world and people have been using sauces for dipping for thousands of years.\n\n"
}