{
    "Mountain climber": "Mountaineering, mountain climbing, or alpinism is a set of outdoor activities that involves ascending mountains. Mountaineering-related activities include traditional outdoor climbing, skiing, and traversing via ferratas that have become sports in their own right. Indoor climbing, sport climbing, and bouldering are also considered variants of mountaineering by some, but are part of a wide group of mountain sports.\nUnlike most sports, mountaineering lacks widely applied formal rules, regulations, and governance; mountaineers adhere to a large variety of techniques and philosophies (including grading and guidebooks) when climbing mountains. Numerous local alpine clubs support mountaineers by hosting resources and social activities. A federation of alpine clubs, the International Climbing and Mountaineering Federation (UIAA), is the International Olympic Committee-recognized world organization for mountaineering and climbing. The consequences of mountaineering on the natural environment can be seen in terms of individual components of the environment (land relief, soil, vegetation, fauna, and landscape) and the location/zone of mountaineering activity (hiking, trekking, or climbing zone). Mountaineering impacts communities on economic, political, social and cultural levels, often leading to changes in people's worldviews influenced by globalization, specifically foreign cultures and lifestyles.",
    "Reverse crunch": "The crunch is an abdominal exercise that works the rectus abdominis muscle. It enables both building \"six-pack\" abs and tightening the belly. Crunches use the exerciser's own body weight to tone muscle and are recommended by some experts, despite negative research results, as a low-cost exercise that can be performed at home. Crunches are less effective than other exercises such as planks and carry risk of back injury.",
    "Crunches": "The crunch is an abdominal exercise that works the rectus abdominis muscle. It enables both building \"six-pack\" abs and tightening the belly. Crunches use the exerciser's own body weight to tone muscle and are recommended by some experts, despite negative research results, as a low-cost exercise that can be performed at home. Crunches are less effective than other exercises such as planks and carry risk of back injury.",
    "Russian twist": "The Russian twist is a simple abdominal exercise for working the core, shoulders, and hips. It is typically performed in repetitive sets and tones the core muscles via a twisting motion focused around the abdomen. The exercise can help build strength in the upper torso, which may help in sports such as tennis, swimming, baseball and football, track & field, hockey, golf, lacrosse, or boxing. There are also many variations of the Russian twist that can be used to intensify a workout routine.\n\n",
    "Sit-up": "The sit-up (or curl-up) is an abdominal endurance training exercise to strengthen, tighten and tone the abdominal muscles. It is similar to a crunch (crunches target the rectus abdominis and also work the external and internal obliques), but sit-ups have a fuller range of motion and condition additional muscles.",
    "Barbell Curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
    "Concentration curl": "Bicep curls are a group of weight training exercises in which a person bends their arm towards their body at the elbow in order to make their biceps stronger.\n\n",
    "Pushups": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
    "Diamond push-up": "The push-up (press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines. Variations of push-ups, such as wide-arm push-ups, diamond push-ups target specific muscle groups and provide further challenges.\n\n",
    "Butterfly": "Butterflies are winged insects from the lepidopteran suborder Rhopalocera, characterized by large, often brightly coloured wings that often fold together when at rest, and a conspicuous, fluttering flight. The group comprises the superfamilies Hedyloidea (moth-butterflies in the Americas) and Papilionoidea (all others). The oldest butterfly fossils have been dated to the Paleocene, about 56 million years ago, though they may have originated earlier.\nButterflies have a four-stage life cycle, and like other holometabolous insects they undergo complete metamorphosis. Winged adults lay eggs on the food plant on which their larvae, known as caterpillars, will feed. The caterpillars grow, sometimes very rapidly, and when fully developed, pupate in a chrysalis. When metamorphosis is complete, the pupal skin splits, the adult insect climbs out, expands its wings to dry, and flies off.\nSome butterflies, especially in the tropics, have several generations in a year, while others have a single generation, and a few in cold locations may take several years to pass through their entire life cycle.Butterflies are often polymorphic, and many species make use of camouflage, mimicry, and aposematism to evade their predators. Some, like the monarch and the painted lady, migrate over long distances. Many butterflies are attacked by parasites or parasitoids, including wasps, protozoans, flies, and other invertebrates, or are preyed upon by other organisms. Some species are pests because in their larval stages they can damage domestic crops or trees; other species are agents of pollination of some plants. Larvae of a few butterflies (e.g., harvesters) eat harmful insects, and a few are predators of ants, while others live as mutualists in association with ants. Culturally, butterflies are a popular motif in the visual and literary arts. The Smithsonian Institution says \"butterflies are certainly one of the most appealing creatures in nature\".",
    "Sumo deadlift": "The Sumo deadlift is a variation of the conventional deadlift often adopted by powerlifters.\nThe difference between the two lies in the setup of the lifter's feet and hands. When the bar is gripped with the lifter's hands inside their legs, the form is considered \"Sumo\". Traditionally, hip stance is far wider in Sumo deadlifts, and toes are pointed slightly outwards.The Sumo deadlift may be advantageous to people with exceptional hip mobility, a long torso, or short arms, as it allows the hips to start closer to the bar, with the torso in a more upright position. Another advantage of the Sumo deadlift is decreased shearing force on the lumbar spine when compared to the conventional deadlift. Other benefits of the Sumo deadlift include: Strengthening the quadriceps, glutes, hamstrings, and other muscles of the posterior chain. In addition to building strength and muscle mass, the Sumo deadlift can be used as a rehabilitation exercise to overcome back injury.\n\n",
    "Power clean": "The clean and jerk is a composite of two weightlifting movements, most often performed with a barbell: the clean and the jerk. During the clean, the lifter moves the barbell from the floor to a racked position across the deltoids, without resting fully on the clavicles. During the jerk, the lifter raises the barbell to a stationary position above the head, finishing with straight arms and legs, and the feet in the same plane as the torso and barbell.\nOf the several variants of the lift, the most common is the Olympic clean and jerk, which, with the snatch, is included in Olympic weightlifting events.",
    "Inchworm": "The geometer moths are moths belonging to the family Geometridae of the insect order Lepidoptera, the moths and butterflies. Their scientific name derives from the Ancient Greek geo γεω (derivative form of γῆ or γαῖα \"the earth\"), and metron μέτρον \"measure\" in reference to the way their larvae, or inchworms, appear to measure the earth as they move along in a looping fashion. Geometridae is a very large family, containing around 23,000 described species; over 1400 species from six subfamilies are indigenous to North America alone. A well-known member is the peppered moth, Biston betularia, which has been the subject of numerous studies in population genetics. Several other geometer moths are notorious pests.\n\n",
    "Pullups": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands, gripping a bar or other implement at a distance typically wider than shoulder-width, and pulled up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. \nPull-ups build up several muscles of the upper body, including the latissimus dorsi, trapezius, and biceps brachii. A pull-up may be performed with overhand (pronated), underhand (supinated)—sometimes referred to as a chin-up—neutral, or rotating hand position. \nPull-ups are used by some organizations as a component of fitness tests, and as a conditioning activity for some sports.\n\n",
    "Rope climb": "Rope climbing is a sport in which competitors attempt to climb up a suspended vertical rope using only their hands. Rope climbing is practiced regularly at the World Police and Fire Games, and is enjoying a resurgence in France, where competitions are held in shopping centers. Also, enthusiasts in the Czech Republic resurrected the sport in 1993, and hold local and national competitions.",
    "Back extension": "A back extension is an exercise that works the lower back as well as the mid and upper back, specifically the Erector spinae. Each of us have two Erector spinae muscles, one of either side of the spine that run along the entire length of the spine. Erector spinae muscles are actually formed of three smaller muscles – spinalis, longissimus, and iliocostalis.",
    "Superman": "Superman is a superhero who appears in American comic books published by DC Comics. The character was created by writer Jerry Siegel and artist Joe Shuster, and debuted in the comic book Action Comics #1 (cover-dated June 1938 and published April 18, 1938). Superman has been adapted to a number of other media, which includes radio serials, novels, films, television shows, theater, and video games.\nSuperman was born on the fictional planet Krypton with the birth name of Kal-El. As a baby, his parents sent him to Earth in a small spaceship shortly before Krypton was destroyed in a natural cataclysm. His ship landed in the American countryside near the fictional town of Smallville. He was found and adopted by farmers Jonathan and Martha Kent, who named him Clark Kent. Clark began developing various superhuman abilities, such as incredible strength and impervious skin. His adoptive parents advised him to use his powers for the benefit of humanity, and he decided to fight crime as a vigilante. To protect his personal life, he changes into a colorful costume and uses the alias \"Superman\" when fighting crime. Clark resides in the fictional American city of Metropolis, where he works as a journalist for the Daily Planet. Superman's supporting characters include his love interest and fellow journalist Lois Lane, Daily Planet photographer Jimmy Olsen, and editor-in-chief Perry White, and his enemies include Brainiac, General Zod, Darkseid, and his archenemy, Lex Luthor.\nSuperman is the archetype of the superhero: he wears an outlandish costume, uses a codename, and fights evil with the aid of extraordinary abilities. Although there are earlier characters who arguably fit this definition, it was Superman who popularized the superhero genre and established its conventions. He was the best-selling superhero in American comic books up until the 1980s.",
    "Child's pose": "Bālāsana (Sanskrit: बालासन) or Child Pose, is a kneeling asana in modern yoga as exercise. Balasana is a counter asana for various asanas and is usually practiced before and after Sirsasana.\n\n",
    "Rower": "Rowing, sometimes called crew in the United States, is the sport of racing boats using oars. It differs from paddling sports in that rowing oars are attached to the boat using oarlocks, while paddles are not connected to the boat. Rowing is divided into two disciplines: sculling and sweep rowing. In sculling, each rower holds two oars, one in each hand, while in sweep rowing each rower holds one oar with both hands. There are several boat classes in which athletes may compete, ranging from single sculls, occupied by one person, to shells with eight rowers and a coxswain, called eights. There are a wide variety of course types and formats of racing, but most elite and championship level racing is conducted on calm water courses 2 kilometres (1.2 mi) long with several lanes marked using buoys.\nModern rowing as a competitive sport can be traced to the early 17th century when professional watermen held races (regattas) on the River Thames in London, England. Often prizes were offered by the London Guilds and Livery Companies. Amateur competition began towards the end of the 18th century with the arrival of \"boat clubs\" at British public schools. Similarly, clubs were formed at colleges within Oxford and Cambridge on the programme for the 1896 games, racing did not take place due to bad weather. Male rowers have competed since the 1900 Summer Olympics. Women's rowing was added to the Olympic programme in 1976. Today, there are fourteen boat classes which race at the Olympics.  \nIn addition, the sport's governing body, the World Rowing Federation, holds the annual World Rowing Championships with twenty-two boat classes.\nAcross six continents, 150 countries now have rowing federations that participate in the sport.  Major domestic competitions take place in dominant rowing nations and include The Boat Race and Henley Royal Regatta in the United Kingdom, the Australian Rowing Championships in Australia, the Harvard–Yale Regatta and Head of the Charles Regatta in the United States, and the Royal Canadian Henley Regatta in Canada. Many other competitions often exist for racing between clubs, schools, and universities in each nation.",
    "Zercher squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. Squats also help the hip muscles.\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.The squat is one of the three lifts in the strength sport of powerlifting, together with the deadlift and the bench press. It is also considered a staple exercise in many popular recreational exercise programs. In powerlifting, it is categorized as raw squats or equipped squats which involves wearing a squat suit.\n\n",
    "Elliptical trainer": "An elliptical trainer or cross-trainer is a stationary exercise machine used to stair climb, walk, or run without causing excessive pressure to the joints, hence decreasing the risk of impact injuries. For this reason, people with some injuries can use an elliptical to stay fit, as the low impact affects them little. Elliptical trainers offer a non-impact cardiovascular workout that can vary from light to high intensity based on the speed of the exercise and the resistance preference set by the user.\nElliptical trainers first entered the market in the 1990s, invented by Precor.Most elliptical trainers work the user's upper and lower body (although some models do not have moving upper body components). Though elliptical trainers are considered to be minimal-impact, they are an example of a weight-bearing form of exercise. They can be self-powered by user-generated motion or need to be plugged in for adjustment of motion and/or for supplying their electronic consoles and resistance systems.\n\n",
    "Stairmaster": "StairMaster is an American company specializing in the design and production of fitness equipment. They sell cardiovascular and strength equipment such as stair climbing machines, TreadClimber cardio machines and dumbbell sets. The Stairmaster was so widely used that people referred to nearly all other brands of step climbers as StairMasters.",
    "Leg Extensions": "The leg extension is a resistance weight training exercise that targets the quadriceps muscle (m. quadriceps femoris) in the legs. The exercise is done using a machine called the Leg Extension Machine. There are various manufacturers of these machines and each one is slightly different. Most gym and weight rooms will have the machine in their facility. The leg extension is an isolated exercise targeting one specific muscle group, the quadriceps. It should not be considered as a total leg workout, such as the squat or deadlift.The exercise consists of bending the leg at the knee and extending the legs, then lowering them back to the original position.",
    "Stationary bike": "A stationary bicycle (also known as exercise bicycle, exercise bike, spinning bike, spin bike, or exercycle) is a device used as exercise equipment for indoor cycling. It includes a saddle, pedals, and some form of handlebars arranged as on a (stationary) bicycle.A stationary bicycle is usually a special-purpose exercise machine resembling a bicycle without wheels. It is also possible to adapt an ordinary bicycle for stationary exercise by placing it on bicycle rollers or a trainer. Rollers and trainers are often used by racing cyclists to warm up before racing, or to train on their own machines indoors.",
    "Jumping rope": "A skipping rope  or jump rope  is a tool used in the sport of skipping/jump rope where one or more participants jump over a rope swung so that it passes under their feet and over their heads. There are multiple subsets of skipping/jump rope, including single freestyle, single speed, pairs, three-person speed (Double Dutch), and three-person freestyle (Double Dutch freestyle).\nRope skipping is commonly performed as an exercise or recreational activity, and there are also many major organizations that support jump rope as a competitive sport. Often separated by sex and age, events include hundreds of competitive teams all around the world. In the US, schools rarely have jump rope teams, and few states have sanctioned official events at the elementary school level. In freestyle events, jumpers use a variety of basic and advanced techniques in a routine of one minute, which is judged by a head judge, content judges, and performance judges. In speed events, a jumper alternates their feet with the rope going around the jumper every time one of their feet hits the ground for 30 seconds, one minute, or three minutes. The jumper is judged on the number of times the right foot touches the ground in those times.",
    "Broad jump": "The long jump is a track and field event in which athletes combine speed, strength and agility in an attempt to leap as far as possible from a takeoff point.  Along with the triple jump, the two events that measure jumping for distance as a group are referred to as the \"horizontal jumps\". This event has a history in the ancient Olympic Games and has been a modern Olympic event for men since the first Olympics in 1896 and for women since 1948.",
    "Jumping Jack": "A jumping jack, also known as a star jump and called a side-straddle hop in the US military, is a physical jumping exercise performed by jumping to a position with the legs spread wide and the hands going overhead, sometimes in a clap, and then returning to a position with the feet together and the arms at the sides.\nThe name origin for the jumping jack exercise has sometimes erroneously been identified as World War I U.S. General John J. \"Black Jack\" Pershing, who is said to have developed the exercise, but in fact the name comes from the jumping jack children's toy, which makes similar arm swing and leg splay motions when the strings are tugged.\nAlthough he played no part in inventing the exercise, the late fitness expert Jack LaLanne was given credit for popularizing it in the United States. LaLanne used the jumping exercise during routines he promoted in decades of television fitness programming.",
    "Speed skater": "Speed skating is a competitive form of ice skating in which the competitors race each other in travelling a certain distance on skates. Types of speed skating are long-track speed skating, short-track speed skating, and marathon speed skating. In the Olympic Games, long-track speed skating is usually referred to as just \"speed skating\", while short-track speed skating is known as \"short track\". The International Skating Union (ISU), the governing body of competitive ice sports, refers to long track as \"speed skating\" and short track as \"short track skating\".\nAn international federation was founded in 1892, the first for any winter sport. The sport enjoys large popularity in the Netherlands, Norway and South Korea. There are top international rinks in a number of other countries, including Canada, the United States, Germany, Italy, Japan, Russia, Kazakhstan, China, Belarus and Poland. A World Cup circuit is held with events in those countries plus two events in the Thialf ice hall in Heerenveen, Netherlands.",
    "Clean and press": "The clean and press is a two-part weight training exercise whereby a loaded barbell is lifted from the floor to the shoulders (the clean) and pushed overhead (the press). The lift was a component of the sport of Olympic weightlifting from 1928 to 1972, but was removed due to difficulties in judging proper technique.\n\n",
    "Clean and jerk": "The clean and jerk is a composite of two weightlifting movements, most often performed with a barbell: the clean and the jerk. During the clean, the lifter moves the barbell from the floor to a racked position across the deltoids, without resting fully on the clavicles. During the jerk, the lifter raises the barbell to a stationary position above the head, finishing with straight arms and legs, and the feet in the same plane as the torso and barbell.\nOf the several variants of the lift, the most common is the Olympic clean and jerk, which, with the snatch, is included in Olympic weightlifting events.",
    "Military press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.\n\n",
    "Arnold press": "The overhead press, also known as the shoulder press, strict press or military press, is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing. It is mainly used to develop the anterior deltoid muscles of the shoulder. The standing version was once a component of the sport of Olympic weightlifting as part of the clean and press movement, but was removed in 1972 due to difficulties in judging proper technique.\nThe lift is set up by taking either a barbell, a pair of dumbbells or kettlebells, and holding them at shoulder level. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscles as more balancing is required in order to support the lift. Other variations of the exercise include the push press, a similar movement that involves an additional dipping motion in the legs to increase momentum. An overhead press may also be performed unilaterally, with the lift being performed one handed; or in an alternating fashion with both hands holding a dumbbell or kettlebell, and then pressing with one arm and then the other.\n\n",
    "Dumbbell front raise": "The front raise exercise is used in weight training. It primarily works the anterior deltoid and the clavicular head of the pectoralis major through the use of arm abduction and flexion through the frontal plane. The training volume, or number of sets and repetitions performed, depends on the lifter's training program and goals.",
    "Battle ropes": "Battling ropes (also known as battle ropes or heavy ropes) are used for fitness training to increase full body strength and conditioning. They were designed by John Brookfield in 2006, who developed the system around his backyard. The battling rope can be alternatively used as a resistance training technique. After its development, he taught the system to Special Forces, the Cincinnati Bengals, and the Olympic wrestling team. Since then, the training system has increased in popularity and has expanded to mainstream gyms.Battling ropes have numerous advantages including the fact they are safe, easy to use, and increase power output. With one battle rope per upper extremity, they also work out each arm independently, overcoming strength imbalances. It also reduces orthopedic load on joints.Battling ropes are thick, heavy and strong in order to give significant resistance, and there are numerous types of ropes used. The ropes typically have two common diameters (25 mm and 44 mm) and common standard lengths (5 m, 10 m, and 25 m). Some battle ropes now have a flexible metal core, making them heavier, shorter and allowing the user to move during training without being restricted by an anchor point.",
    "Handstand push-up": "The handstand push-up (press-up) - also called the vertical push-up (press-up) or the inverted push-up (press-up) also called \"commandos\"- is a type of push-up exercise where the body is positioned in a handstand. For a true handstand, the exercise is performed free-standing, held in the air. To prepare the strength until one has built adequate balance, the feet are often placed against a wall, held by a partner, or secured in some other way from falling. Handstand pushups require significant strength, as well as balance and control if performed free-standing.\n\n",
    "Wall walk": "A chemin de ronde (French, \"round path\"' or \"patrol path\"; French pronunciation: [ʃəmɛ̃ də ʁɔ̃d]), also called an allure, alure or, more prosaically, a wall-walk, is a raised protected walkway behind a castle battlement.In early fortifications, high castle walls were difficult to defend from the ground. The chemin de ronde was devised as a walkway allowing defenders to patrol the tops of ramparts, protected from the outside by the battlements or a parapet, placing them in an advantageous position for shooting or dropping.",
    "Shadow boxing": "Shadowboxing is a combat sport exercise in which a person throws punches at the air as though there is an opponent. Practised primarily in boxing, it is used mainly to prepare the muscles before the person training engages in stronger physical activity. Muhammad Ali once performed a now famous shadowboxing routine next to Howard Cosell for ABC's Wide World of Sports television cameras. Black Nova Scotian boxer George Dixon is widely credited for developing the technique.\n\n",
    "Triceps dip": "A dip is an upper-body strength exercise. Close grip dips primarily train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles, and the rhomboid muscles of the back. Wide shoulder width dips place additional emphasis on the pectoral muscles, similar in respect to the way a wide grip bench press would focus more on the pectorals and less on the triceps."
}